{
    "2025-02-17": [
        {
            "title": "China’s Xi meets with business leaders, including Alibaba co-founder Jack Ma, to boost economy",
            "description": "BANGKOK (AP) — China’s President Xi Jinping met with private sector business leaders on Monday, state media reported, as government officials work to revive an economy disrupted by a pandemic, regulatory crackdowns and a real estate crisis. Among the delegate…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/chinas-xi-meets-with-business-leaders-including-alibaba-co-founder-jack-ma-to-boost-economy",
            "publishedAt": "2025-02-17T10:40:55Z"
        },
        {
            "title": "China’s Xi hosts top tech bosses, Alibaba co-founder Jack Ma spotted in attendance",
            "description": "Chinese leader Xi Jinping hosted Alibaba co-founder Jack Ma and the country’s top tech executives in Beijing on Monday, in a meeting that signals officials could be steering the country in a more business-friendly direction after a yearslong regulatory crackd…",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/02/17/tech/china-jack-ma-alibaba-meeting-hnk-intl/index.html",
            "publishedAt": "2025-02-17T07:10:53Z"
        }
    ],
    "2025-02-13": [
        {
            "title": "Apple picks Alibaba to launch AI features in China | CNN Business",
            "description": "Apple will work with Chinese tech giant Alibaba to roll out AI services in the world’s biggest market for mobile phones, in a move that removes months of uncertainty for the Cupertino-based firm.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/02/13/tech/china-apple-alibaba-ai-hnk-intl/index.html",
            "publishedAt": "2025-02-13T10:32:59Z"
        }
    ],
    "2025-02-24": [
        {
            "title": "Alibaba shares tumble as Trump order stirs China trade angst",
            "description": "Alibaba Group Holding Ltd shares tumbled as Donald Trump’s latest executive order stirred fears about deepening trade tensions. Read more",
            "source": "Financial Post",
            "url": "https://financialpost.com/news/alibaba-shares-tumble",
            "publishedAt": "2025-02-24T21:58:56Z"
        }
    ],
    "2025-03-06": [
        {
            "title": "Chinese AI: Manus ‘agent’ and Alibaba’s new model released in quick succession",
            "description": "The Chinese tech giant unveiled its latest AI reasoning model on Thursday, saying it beats rivals from OpenAI and DeepSeek. The day before another company launched a “general AI agent” called Manus.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/06/tech/china-alibaba-ai-model-deepseek-hnk-intl/index.html",
            "publishedAt": "2025-03-06T09:41:38Z"
        }
    ],
    "2025-03-24": [
        {
            "title": "Tencent upgrades AI model to compete with DeepSeek, Alibaba",
            "description": "A team of Tencent engineers claimed in an event streamed online that the new model has cutting-edge logic and writing capabilities, with few hallucinations or distortions",
            "source": "Bloomberg",
            "url": "https://www.bloomberg.com/news/articles/2025-03-21/tencent-upgrades-deepseek-style-reasoning-model-in-ai-catch-up",
            "publishedAt": "2025-03-24T03:47:53Z"
        }
    ]
}