{
    "2025-01-31": [
        {
            "title": "Heard on the Street Thursday Recap: Chip Spending",
            "description": "It is never a good thing when your biggest customer breaks away.That seems to be the case for UPS, which said it was cutting volumes from its largest customer—Amazon—by half. UPS warned that revenue would come in about $6 billion lower than expected this year…",
            "source": "The Wall Street Journal",
            "url": "https://www.wsj.com/livecoverage/stock-market-today-pce-inflation-data-01-31-2025/card/heard-on-the-street-thursday-recap-chip-spending-hzCLFa49tgfXYAIFywYw",
            "publishedAt": "2025-01-31T08:02:42Z"
        }
    ],
    "2025-02-04": [
        {
            "title": "Amazon to face legal action after laying off 1,900 in Quebec",
            "description": "The Federation of National Trade Unions will petition a court to annul the layoffs and order the reopening of the warehouses. Keep reading.",
            "source": "Financial Post",
            "url": "https://financialpost.com/fp-work/amazon-face-legal-action-quebec-layoffs",
            "publishedAt": "2025-02-04T15:19:20Z"
        },
        {
            "title": "Quebec union group urges Amazon boycott after warehouse closure announcement",
            "description": "MONTREAL — A Quebec labour group is urging governments and the public to boycott Amazon because the online retail giant announced the closure of its seven warehouses in the province a few months after workers at one of the facilities voted to unionize. CSN pr…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/quebec-union-group-urges-amazon-boycott-after-warehouse-closure-announcement",
            "publishedAt": "2025-02-04T18:55:23Z"
        },
        {
            "title": "Amazon to Face Legal Action After Laying Off 1,900 in Quebec",
            "description": "Amazon.com Inc.’s decision to close all seven of its warehouses in the Canadian province of Quebec and terminate more than 1,900 workers is prompting legal action from the affected union.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/amazon-to-face-legal-action-after-laying-off-1900-in-quebec",
            "publishedAt": "2025-02-04T15:19:20Z"
        }
    ],
    "2025-01-29": [
        {
            "title": "Terence Corcoran: Feds bail out Canada Post while threatening Amazon",
            "description": "Terence Corcoran: Post office gets $1B, Amazon may get a 'review.' Is this how business is done in Canada? Read here for more",
            "source": "Financial Post",
            "url": "https://financialpost.com/opinion/terence-corcoran-feds-bail-out-canada-post-while-threatening-amazon",
            "publishedAt": "2025-01-29T11:00:53Z"
        }
    ],
    "2025-01-30": [
        {
            "title": "Amazon sues state agency to block release of company records to Bezos-owned Washington Post",
            "description": "Amazon is suing a Washington state agency to prevent the release of some company materials to The Washington Post, the newspaper which is owned by Amazon founder Jeff Bezos. In a lawsuit filed this week in King County Superior Court, the Seattle-based company…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/amazon-sues-state-agency-to-block-release-of-company-records-to-bezos-owned-washington-post",
            "publishedAt": "2025-01-30T19:19:49Z"
        }
    ],
    "2025-02-03": [
        {
            "title": "The AI generator that fact checks your content",
            "description": "Katteb AI can create everything from long-form articles to Amazon product reviews—lifetime access is now on sale.",
            "source": "Financial Post",
            "url": "https://financialpost.com/personal-finance/business-essentials/katteb-ai-subscription",
            "publishedAt": "2025-02-03T18:30:04Z"
        }
    ],
    "2025-01-14": [
        {
            "title": "Tenovos Selected as an Amazon Bedrock Data Automation (BDA) Launch Partner",
            "description": "NEW YORK — Tenovos, the modern data-first digital asset management (DAM) platform, announced that it is a launch partner of Amazon Bedrock Data Automation (BDA), a new feature of Amazon Bedrock that simplifies and accelerates the development of generative AI …",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/tenovos-selected-as-an-amazon-bedrock-data-automation-bda-launch-partner",
            "publishedAt": "2025-01-14T09:01:18Z"
        }
    ],
    "2025-01-10": [
        {
            "title": "Amazon halting some of its diversity and inclusion programs",
            "description": "Amazon Inc. is halting some of its diversity and inclusion programs, coinciding with industry pressure to abandon DEI efforts. Read for more",
            "source": "Financial Post",
            "url": "https://financialpost.com/news/amazon-halting-diversity-inclusion-programs",
            "publishedAt": "2025-01-10T22:00:36Z"
        }
    ],
    "2025-01-13": [
        {
            "title": "A.J. Brown’s sideline read skyrockets to No. 1 hottest seller on Amazon",
            "description": "PHILADELPHIA (AP) — Step aside, Oprah. Philadelphia Eagles star receiver A.J. Brown could launch a book club of his own after a little sideline reading skyrocketed self-help author Jim Murphy to the hottest seller on Amazon overnight. The Eagles wide receiver…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/a-j-browns-sideline-read-skyrockets-to-no-1-hottest-seller-on-amazon",
            "publishedAt": "2025-01-13T16:48:20Z"
        }
    ],
    "2025-01-09": [
        {
            "title": "Tenovos Achieves the AWS Consumer Goods Competency",
            "description": "NEW YORK — Tenovos, the modern data-first digital asset management (DAM) platform, announces that it has achieved the Amazon Web Services (AWS) Consumer Goods Competency. As an AWS Partner, Tenovos has earned the AWS Consumer Goods Competency designation, rec…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/tenovos-achieves-the-aws-consumer-goods-competency",
            "publishedAt": "2025-01-09T15:06:31Z"
        }
    ],
    "2025-01-24": [
        {
            "title": "Amazon Layoffs Prompt Canada to Review Government Deals",
            "description": "Canada’s industry minister said Amazon.com Inc.’s decision to shut down all warehouses in Quebec and cut close to 2,000 jobs would prompt the government to examine its current deals with the e-commerce and technology company.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/amazon-layoffs-prompt-canada-to-review-government-deals",
            "publishedAt": "2025-01-24T17:41:26Z"
        },
        {
            "title": "Canada to review government deals with Amazon after layoffs",
            "description": "Industry minister Francois-Philippe Champagne said Amazon's decision to shut down Quebec warehouses would prompt an examination. Read more.",
            "source": "Financial Post",
            "url": "https://financialpost.com/news/retail-marketing/amazon-layoffs-canada-government-deals",
            "publishedAt": "2025-01-24T12:29:07Z"
        },
        {
            "title": "Ottawa to review ‘business relationship’ with Amazon following Quebec shutdown",
            "description": "OTTAWA — The federal industry minister is calling for a review of Ottawa’s “business relationship” with Amazon after the company said it will close all seven of its warehouses in Quebec. “They’ll have me fighting to make sure that this is not going to go unan…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/ottawa-to-review-business-relationship-with-amazon-following-quebec-shutdown",
            "publishedAt": "2025-01-24T19:53:36Z"
        },
        {
            "title": "What Amazon’s Quebec exit means for shoppers, workers, landlords and government",
            "description": "The e-commerce giant said this week it will close all seven of its facilities in the province by March, sparking union outrage. Read on.",
            "source": "Financial Post",
            "url": "https://financialpost.com/news/retail-marketing/what-amazon-quebec-exit-means-shoppers-workers-landlords-government",
            "publishedAt": "2025-01-24T16:35:24Z"
        }
    ],
    "2025-01-28": [
        {
            "title": "William Watson: Ottawa tells Amazon be more like Canada Post",
            "description": "William Watson: As Ottawa lends Canada Post $1 billion to chart a viability route, it wants Amazon to be more like the mail. Read more here",
            "source": "Financial Post",
            "url": "https://financialpost.com/opinion/william-watson-ottawa-tells-amazon-be-like-canada-post",
            "publishedAt": "2025-01-28T11:00:59Z"
        },
        {
            "title": "Workers at a Whole Foods Market in Philadelphia become the 1st to unionize",
            "description": "Workers at a Whole Foods Market in Pennsylvania voted to unionize on Monday, becoming the first group of employees to pull off a labor win at the Amazon-owned grocery store chain. Employees at the Philadelphia store cast 130 votes — or about 57% of the ballot…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/workers-at-a-whole-foods-market-in-philadelphia-become-the-1st-to-unionize",
            "publishedAt": "2025-01-28T03:12:39Z"
        }
    ],
    "2025-01-22": [
        {
            "title": "Amazon to close all warehouses in Quebec, eliminating 1,900 jobs",
            "description": "The announcement is unrelated to those unionization efforts, Amazon, adding it has no plans to close warehouses elsewhere. Keep reading here",
            "source": "Financial Post",
            "url": "https://financialpost.com/fp-work/amazon-to-close-all-warehouses-in-quebec-eliminating-1900-jobs",
            "publishedAt": "2025-01-22T15:55:08Z"
        },
        {
            "title": "Amazon to Close Warehouses in Quebec, Eliminating 1,900 Jobs",
            "description": "Amazon.com Inc. will shut down all warehouses and lay off employees in the French-speaking Canadian province of Quebec. The decision comes less than a year after workers at one of those facilities unionized.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/amazon-to-close-warehouses-in-quebec-eliminating-1900-jobs",
            "publishedAt": "2025-01-22T17:17:32Z"
        },
        {
            "title": "Amazon Canada says it will close all seven of its warehouses in Quebec",
            "description": "Amazon Canada says it will close all seven of its Quebec warehouses and lay off staff over the next two months. The e-commerce giant positioned the move scuttling 1,700 permanent jobs and 250 temporary ones as a way to provide “even more savings to our custom…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/amazon-canada-says-it-will-close-all-seven-of-its-warehouses-in-quebec",
            "publishedAt": "2025-01-22T16:58:05Z"
        }
    ],
    "2025-01-27": [
        {
            "title": "Pacvue Rolls Out Amazon DSP Management and Optimization Tools to LATAM, EMEA and APAC",
            "description": "Starting today, businesses outside of North America can utilize Pacvue’s full suite of campaign management tools to optimize their Amazon DSP (Demand-Side Platform) campaigns LOS ANGELES, Jan. 27, 2025 (GLOBE NEWSWIRE) — Pacvue, the leading commerce accelerat…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/pacvue-rolls-out-amazon-dsp-management-and-optimization-tools-to-latam-emea-and-apac",
            "publishedAt": "2025-01-27T14:14:13Z"
        }
    ],
    "2025-01-23": [
        {
            "title": "Amazon closures a ‘slap in the face’ to Quebec workers, union says",
            "description": "More than 1,700 full-time employees will lose their jobs as the e-commerce giant is to close all operations in the province, including its warehouses",
            "source": "Financial Post",
            "url": "https://financialpost.com/news/amazon-quebec-closures-layoffs",
            "publishedAt": "2025-01-23T00:09:05Z"
        }
    ],
    "2025-02-06": [
        {
            "title": "Solomon Partners’ Scott Moses Releases New Book: “A ‘Grocery’ Christmas Carol: The Ghost of Supermarkets Future”",
            "description": "The book traces the evolution of the U.S. grocery industry, the rapid rise of global grocery competitors Walmart, Costco and Amazon, changing consumer grocery shopping habits and the importance of scale to protect Supermarkets Future All profits from the book…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/solomon-partners-scott-moses-releases-new-book-a-grocery-christmas-carol-the-ghost-of-supermarkets-future",
            "publishedAt": "2025-02-06T16:10:26Z"
        }
    ],
    "2025-02-08": [
        {
            "title": "King Dollar Emerges as Fresh Threat for Big Tech Earnings Views",
            "description": "The surge in the dollar is darkening the earnings outlook for US multinational companies from Amazon.com Inc. to Apple Inc., leaving investors to question how much longer the stock rally can withstand the greenback’s strength.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/king-dollar-emerges-as-fresh-threat-for-big-tech-earnings-views",
            "publishedAt": "2025-02-08T13:46:59Z"
        }
    ],
    "2025-02-11": [
        {
            "title": "Tealium achieves the first AWS Automotive Competency in the CDP category",
            "description": "Tealium is recognized for its demonstrated technical proficiency and proven customer success in the automotive space San Diego, Feb. 11, 2025 (GLOBE NEWSWIRE) — Tealium, the intelligent real-time data streaming platform, has achieved the Amazon Web Services (…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/tealium-achieves-the-first-aws-automotive-competency-in-the-cdp-category",
            "publishedAt": "2025-02-11T15:04:02Z"
        }
    ],
    "2025-02-20": [
        {
            "title": "James Bond's long-serving producers give control to Amazon",
            "description": "Barbara Broccoli and Michael G Wilson step down after decades of tight family control of the franchise.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c1mn9gz5x3mo",
            "publishedAt": "2025-02-20T14:21:30Z"
        },
        {
            "title": "Barbara Broccoli on Amazon, in Private: ‘These People Are Fucking Idiots’",
            "description": "No description available",
            "source": "The Wall Street Journal",
            "url": "https://www.wsj.com/business/media/james-bond-movies-amazon-barbara-broccoli-0b04f0db?st=P86jBM&reflink=desktopwebshare_permalink",
            "publishedAt": "2025-02-20T19:42:32Z"
        },
        {
            "title": "Amazon MGM Studios takes creative control of James Bond franchise | CNN Business",
            "description": "Michael G. Wilson and Barbara Broccoli will remain co-owners in a new joint venture with Amazon MGM that hands over the creative reins and control of all future production to the Jeff Bezos-founded company.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/02/20/business/amazon-mgm-james-bond/index.html",
            "publishedAt": "2025-02-20T16:13:39Z"
        }
    ],
    "2025-02-15": [
        {
            "title": "Amazon workers at North Carolina warehouse vote against unionizing | CNN Business",
            "description": "Amazon workers at a warehouse in North Carolina voted against forming a union, another setback in the movement’s efforts against a company and state that is generally hostile to organizing.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/02/15/business/amazon-workers-reject-north-carolina-union/index.html",
            "publishedAt": "2025-02-15T23:23:48Z"
        }
    ],
    "2025-02-26": [
        {
            "title": "Amazon’s new AI-powered Alexa promises to be your ‘best friend in a digital world’ for a monthly fee",
            "description": "NEW YORK (AP) — Amazon on Wednesday unveiled a generative-AI infused Alexa that it says will allow the popular voice assistant to have more personality, check a user’s tone and even plan romantic dates. But unlike before, when Alexa was offered for free on an…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/amazons-new-ai-powered-alexa-promises-to-be-your-best-friend-in-a-digital-world-for-a-monthly-fee",
            "publishedAt": "2025-02-26T18:02:48Z"
        },
        {
            "title": "Mavenir and OXIO Powering the Next Generation of MVNOs",
            "description": "OXIO’s Telecom-as-a-Service Platform integrates Mavenir Packet Core, IMS and Messaging solutions on Amazon Web Services for enhanced agility RICHARDSON, Texas, Feb. 26, 2025 (GLOBE NEWSWIRE) — Mavenir, the cloud-native network infrastructure provider building…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/mavenir-and-oxio-powering-the-next-generation-of-mvnos",
            "publishedAt": "2025-02-26T17:54:30Z"
        }
    ],
    "2025-02-25": [
        {
            "title": "In Brazil, mining giant Vale is sued over metal contamination found in Indigenous peoples",
            "description": "BRASILIA, Brazil (AP) — Brazil’s Federal Prosecutor’s Office is suing the giant mining company Vale, the Brazilian government and the Amazon state of Para over heavy metal contamination in the bodies of Xikrin Indigenous people. The civil lawsuit, filed Frida…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/in-brazil-mining-giant-vale-is-sued-over-metal-contamination-found-in-indigenous-peoples",
            "publishedAt": "2025-02-25T20:48:22Z"
        }
    ],
    "2025-03-03": [
        {
            "title": "Canadians Shun Amazon in Consumer Protest Against US, Poll Finds",
            "description": "A majority of Canadian consumers said they’ve pulled back on buying US-made products and are shopping less on Amazon.com Inc. since US President Donald Trump escalated his threats against Canada.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/canadians-shun-amazon-in-consumer-protest-against-us-poll-finds",
            "publishedAt": "2025-03-03T09:20:50Z"
        }
    ],
    "2025-03-01": [
        {
            "title": "Anti-Amazon protesters in Montreal rally once again for boycott demonstration",
            "description": "MONTREAL — Protesters accusing Amazon of union-busting gathered in downtown Montreal today to continue their calls for a boycott of the company after it decided to shutter its Quebec warehouses in the province in January. Felix Trudeau, union president for th…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/anti-amazon-protesters-in-montreal-rally-once-again-for-boycott-demonstration",
            "publishedAt": "2025-03-01T22:04:54Z"
        }
    ],
    "2025-03-06": [
        {
            "title": "Xsolla Cloud Gaming Expands Developer Access to New Users With Global Reach",
            "description": "Expanding Player Reach With Cloud-Enabled Demos And Seamless Gaming Experience Across PC And Mobile Platforms LOS ANGELES — Xsolla, a leading global video game commerce company, announces updates to Xsolla Cloud Gaming solution. Powered by the new Amazon Game…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/xsolla-cloud-gaming-expands-developer-access-to-new-users-with-global-reach",
            "publishedAt": "2025-03-06T14:10:02Z"
        }
    ],
    "2025-03-09": [
        {
            "title": "Next James Bond should stay British, former 007 Pierce Brosnan says",
            "description": "The Irish actor says he hopes Amazon \"handles the character with dignity and imagination and respect\".",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c4g0wldz314o",
            "publishedAt": "2025-03-09T04:58:36Z"
        },
        {
            "title": "Pierce Brosnan says he hopes Amazon MGM Studios treats James Bond franchise with ‘respect’ | CNN",
            "description": "Pierce Brosnan still holds dear his turn as 007 in the James Bond franchise and hopes that the property’s new owners treat it with “respect” and “dignity.”",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/09/entertainment/pierce-brosnan-james-bond-amazon/index.html",
            "publishedAt": "2025-03-09T17:15:51Z"
        }
    ],
    "2025-03-07": [
        {
            "title": "Amazon boycott: The ‘economic blackout’ movement shifts to e-commerce giant Friday",
            "description": "After a viral social media campaign to spend no money at big-box stores happened last week, a fresh one begins Friday targeting Amazon.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/07/business/amazon-economic-blackout/index.html",
            "publishedAt": "2025-03-07T11:53:52Z"
        }
    ],
    "2025-03-14": [
        {
            "title": "Heart and Soul: Ayahuasca and the new spiritual tourism",
            "description": "For centuries, ayahuasca has been a sacred plant for the Shipibo-Konibo peoples of the Peruvian Amazon. Part medicine, part spiritual ceremony, ayahuasca and other plant medicines are revered practices. But in recent years, a boom in Western interest in psych…",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/programmes/p0ky0hb7",
            "publishedAt": "2025-03-14T01:30:00Z"
        }
    ],
    "2025-03-10": [
        {
            "title": "Amazon Music, DistroKid Face Major Lawsuit for Unpaid Royalties, Shadowbanning",
            "description": "NEW YORK, March 10, 2025 (GLOBE NEWSWIRE) — Marc Mysterio is an award-winning musician and multi-faceted celebrity who was tapped by IBA Boxing to compete for its vacant championship vs. Jake Paul and collaborated with a who’s-who–according to Billboard–inclu…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/amazon-music-distrokid-face-major-lawsuit-for-unpaid-royalties-shadowbanning",
            "publishedAt": "2025-03-10T13:05:52Z"
        },
        {
            "title": "Amazon to stream Trump’s ‘The Apprentice’ reality TV series | CNN Business",
            "description": "“The Apprentice,” the NBC reality show that propelled Donald Trump from real estate mogul to TV personality, is getting the streaming treatment at Amazon’s Prime Video.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/10/media/apprentice-trump-amazon-prime/index.html",
            "publishedAt": "2025-03-10T18:07:51Z"
        }
    ],
    "2025-03-12": [
        {
            "title": "Amazon, Occidental Support Tripling of Global Nuclear Power",
            "description": "Major technology and energy companies have pledged to support wider use of nuclear power, as surging demand from data centers and factories outpaces current availability.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/amazon-occidental-support-tripling-of-global-nuclear-power",
            "publishedAt": "2025-03-12T11:08:24Z"
        },
        {
            "title": "Amazon rainforest cut down to build highway for COP climate summit",
            "description": "The infrastructure required to host climate talks in Belém is undermining the cause, campaigners say.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c9vy191rgn1o",
            "publishedAt": "2025-03-12T06:02:29Z"
        },
        {
            "title": "FTC asks to delay Amazon trial over staff shortages following Musk-led cuts | CNN Business",
            "description": "The US Federal Trade Commission asked a federal court in Seattle on Wednesday to delay a September trial in its case alleging Amazon misled consumers over its Prime subscription service, citing “severe resource shortfalls in terms of both money and personnel.”",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/12/tech/ftc-amazon-trial-musk/index.html",
            "publishedAt": "2025-03-12T22:19:36Z"
        }
    ],
    "2025-03-11": [
        {
            "title": "Online retail giant Amazon stops bladed-weapon sales to Manitobans in wake of new law",
            "description": "WINNIPEG — Online retail outlet Amazon said Tuesday it has halted all shipments of machetes and other long-bladed weapons to Manitoba addresses. The move came after the Manitoba government enacted new rules in December to limit in-store sales of such items to…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/online-retail-giant-amazon-stops-bladed-weapon-sales-to-manitobans-in-wake-of-new-law",
            "publishedAt": "2025-03-11T22:42:59Z"
        },
        {
            "title": "Adastra Achieves Premier Tier Services Status within the AWS Partner Network",
            "description": "TORONTO — Adastra Group (also known as Adastra Corporation), a global leader in data analytics and artificial intelligence, proudly announces its achievement of Amazon Web Services (AWS) Premier Tier Services Partner status within the AWS Partner Network (APN…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/adastra-achieves-premier-tier-services-status-within-the-aws-partner-network",
            "publishedAt": "2025-03-11T09:09:21Z"
        }
    ],
    "2025-03-13": [
        {
            "title": "FTC reverses its request for a delay in an Amazon trial, says it has resources to litigate the case",
            "description": "The Federal Trade Commission has walked back comments that a lack of resources is interfering with the agency’s ability to be ready for a September trial over Amazon’s Prime program. Jonathan Cohen, a lawyer for the FTC, had asked a federal judge during a hea…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/ftc-reverses-its-request-for-a-delay-in-an-amazon-trial-says-it-has-resources-to-litigate-the-case",
            "publishedAt": "2025-03-13T14:34:35Z"
        }
    ],
    "2025-03-17": [
        {
            "title": "Mall staple Forever 21 files for bankruptcy protection, again",
            "description": "Forever 21 has filed for bankruptcy protection for a second time as traffic in U.S. shopping malls fades and competition from online retailers like Amazon, Temu and Shein intensifies. F21 OpCo, which runs Forever 21 stores, said late Sunday that it will wind …",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/mall-staple-forever-21-files-for-bankruptcy-protection-again",
            "publishedAt": "2025-03-17T12:57:06Z"
        }
    ],
    "2025-03-26": [
        {
            "title": "Amazon’s allure grows with cheaper shares than Apple, Walmart",
            "description": "A drop in the share price and expectations for long-term earnings growth have made Amazon's valuation appealing to investors. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/amazons-allure-grows-cheaper-shares-apple-walmart",
            "publishedAt": "2025-03-26T20:29:47Z"
        }
    ],
    "2025-03-23": [
        {
            "title": "UK considers big tech tax changes to appease Donald Trump",
            "description": "Rachel Reeves says talks are \"ongoing\" about the Digital Services Tax, paid by giants like Amazon.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c8j0dgym8w1o",
            "publishedAt": "2025-03-23T12:55:40Z"
        }
    ],
    "2025-03-31": [
        {
            "title": "Nokia and Amazon settle patent dispute over streaming technology",
            "description": "Agreement covers use of Nokia video technologies in Amazon’s streaming services and devices, resolving all patent litigation globally",
            "source": "Bloomberg",
            "url": "https://www.bloomberg.com/news/articles/2025-03-31/nokia-and-amazon-settle-patent-dispute-over-streaming-technology",
            "publishedAt": "2025-03-31T09:49:36Z"
        },
        {
            "title": "Nokia and Amazon settle streaming patent dispute",
            "description": "Nokia Oyj and Amazon Inc. settled a patent dispute over streaming technologies that had spread to courts across three continents. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/technology/tech-news/nokia-and-amazon-settle-streaming-patent-dispute",
            "publishedAt": "2025-03-31T20:54:49Z"
        }
    ]
}