{
    "2025-01-29": [
        {
            "title": "ASML CEO Says DeepSeek’s Emergence Is ‘Good News’ for AI",
            "description": "ASML Holding NV’s leader brushed off concerns about the artificial intelligence-driven demand for its chipmaking machines after Chinese startup DeepSeek’s low-cost chatbot roiled markets earlier in the week.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/asml-ceo-says-deepseeks-emergence-is-good-news-for-ai",
            "publishedAt": "2025-01-29T11:32:54Z"
        }
    ],
    "2025-01-24": [
        {
            "title": "ASML Outlook Clouded by Intel, Samsung and China Chip Challenges",
            "description": "After sending shockwaves through the semiconductor industry following a third-quarter earnings miss, scrutiny is building ahead of ASML Holding NV’s results next week with uncertainty over the spending plans of its top clients.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/asml-outlook-clouded-by-intel-samsung-and-china-chip-challenges",
            "publishedAt": "2025-01-24T12:26:01Z"
        }
    ],
    "2025-01-27": [
        {
            "title": "Nvidia, ASML Plunge as DeepSeek Triggers Tech Stock Selloff",
            "description": "Nvidia Corp. and ASML Holding NV shares plunged early Monday as Chinese artificial intelligence startup DeepSeek appeared to provide comparable performance to Western chatbots at a fraction of the price.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/nvidia-asml-plunge-as-deepseek-triggers-tech-stock-selloff",
            "publishedAt": "2025-01-27T10:04:02Z"
        },
        {
            "title": "ASML Earnings Are Make-or-Break for Europe’s Rally in Key Week",
            "description": "As European stocks stumble from an all-time peak, the stakes are high for corporate earnings from a slate of industry bellwethers including ASML Holding NV this week to revive the rally.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/asml-earnings-are-make-or-break-for-europes-rally-in-key-week",
            "publishedAt": "2025-01-27T09:48:45Z"
        }
    ]
}