{
    "2025-01-28": [
        {
            "title": "Raj Juneja appointed as President of Cisco Canada",
            "description": "Toronto, Jan. 28, 2025 (GLOBE NEWSWIRE) — Today, Cisco, the worldwide leader in security and networking, has appointed Raj Juneja as President, Cisco Canada effective February 1, 2025.  With more than 25 years of experience in the technology sector, Juneja ha…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/raj-juneja-appointed-as-president-of-cisco-canada",
            "publishedAt": "2025-01-28T13:33:59Z"
        }
    ],
    "2025-02-04": [
        {
            "title": "Lantronix to Debut New LM4 AI-Powered Out-of-Band Management Platform at Cisco Live",
            "description": "LM4 Platform Brings Affordable Management Automation to IDFs and Small Sites IRVINE, Calif., Feb. 04, 2025 (GLOBE NEWSWIRE) — Lantronix Inc. (NASDAQ: LTRX), a global leader of compute and connectivity for IoT solutions enabling AI Edge intelligence, will debu…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/lantronix-to-debut-new-lm4-ai-powered-out-of-band-management-platform-at-cisco-live",
            "publishedAt": "2025-02-04T12:04:36Z"
        }
    ],
    "2025-02-12": [
        {
            "title": "Cisco Gains After AI-Fueled Networking Spending Lifts Forecast",
            "description": "Cisco Systems Inc. gained in late trading after giving an upbeat sales forecast for the current quarter, helped by companies spending more on computing infrastructure to take advantage of AI technology.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/cisco-gains-after-ai-fueled-networking-spending-lifts-forecast",
            "publishedAt": "2025-02-12T23:47:22Z"
        }
    ],
    "2025-02-13": [
        {
            "title": "Blackline Safety Appoints Paul Semak as Vice President of North American Sales",
            "description": "Former Cisco and Extreme Networks sales leader to drive market expansion and revenue growth CALGARY, Canada — Blackline Safety Corp. (TSX: BLN), a global leader in connected safety technology, today announced the appointment of Paul Semak as Vice President, N…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/blackline-safety-appoints-paul-semak-as-vice-president-of-north-american-sales",
            "publishedAt": "2025-02-13T12:17:35Z"
        }
    ],
    "2025-02-18": [
        {
            "title": "Cisco, IBM, Oracle show old-school tech can be AI winners",
            "description": "Legacy tech stocks are attracting investors with cheaper valuations and tempting dividend yields compared with high flying megacaps. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/cisco-ibm-oracle-can-be-ai-winners",
            "publishedAt": "2025-02-18T15:03:20Z"
        }
    ],
    "2025-03-11": [
        {
            "title": "AMD Unveils 5th Gen AMD EPYC Embedded Processors Delivering Leadership Performance, Efficiency and Long Product Lifecycles for Networking, Storage, and Industrial Edge Markets",
            "description": "— High-performance “Zen 5” architecture offers server-grade performance and efficiency combined with purpose-built features for optimized product longevity and system resiliency — — Cisco and IBM among the first technology partners to adopt 5th Gen AMD EPYC E…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/amd-unveils-5th-gen-amd-epyc-embedded-processors-delivering-leadership-performance-efficiency-and-long-product-lifecycles-for-networking-storage-and-industrial-edge-markets",
            "publishedAt": "2025-03-11T08:01:57Z"
        }
    ],
    "2025-03-10": [
        {
            "title": "CloudBees Celebrates 15 Years of DevOps Industry Impact and Continued Innovation",
            "description": "SAN FRANCISCO, March 10, 2025 (GLOBE NEWSWIRE) — CloudBees, one of the world’s leading software development platforms, today celebrates its 15th anniversary. As pioneers of the DevOps and CI/CD movements, the company is taking this moment to celebrate its imp…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/cloudbees-celebrates-15-years-of-devops-industry-impact-and-continued-innovation",
            "publishedAt": "2025-03-10T13:00:42Z"
        }
    ]
}