{
    "2025-02-04": [
        {
            "title": "China targets Nvidia, Google as Trump tariffs bite",
            "description": "China has revived antitrust investigations into Google and Nvidia, as Beijing looks for leverage in talks with the U.S. Read here for more",
            "source": "Financial Post",
            "url": "https://financialpost.com/financial-times/china-targets-nvidia-google-trump-tariffs",
            "publishedAt": "2025-02-04T17:14:40Z"
        }
    ],
    "2025-01-30": [
        {
            "title": "Samsung Gets Nvidia’s Nod on Less Advanced Version of AI Memory",
            "description": "Samsung Electronics Co. has obtained approval to supply a version of its fifth-generation high-bandwidth memory chips to Nvidia Corp., according to people familiar with the matter.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/samsung-gets-nvidias-nod-on-less-advanced-version-of-ai-memory",
            "publishedAt": "2025-01-30T23:58:39Z"
        }
    ],
    "2025-01-28": [
        {
            "title": "Nvidia faces a reckoning as an upstart rival raises questions about Wall Street’s darling",
            "description": "NEW YORK (AP) — The superstar run for Nvidia’s stock the last few years has been astonishing. So was its tumble Monday, which caused $595 billion in wealth to vanish. That’s about as much as PepsiCo, McDonalds, Starbucks and Target are worth, combined. Mostly…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/nvidia-faces-a-reckoning-as-an-upstart-rival-raises-questions-about-wall-streets-darling",
            "publishedAt": "2025-01-28T21:43:07Z"
        }
    ],
    "2025-01-29": [
        {
            "title": "DeepSeek’s Promise of Energy Efficiency Darkens Power Stocks",
            "description": "The selloff caused by Chinese artificial intelligence startup DeepSeek wasn’t just limited to technology stocks like Nvidia Corp. Shares in energy companies key to the AI buildout were hammered too, leaving some on Wall Street wondering if their valuations ar…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/deepseeks-promise-of-energy-efficiency-darkens-power-stocks",
            "publishedAt": "2025-01-29T10:51:56Z"
        }
    ],
    "2025-01-16": [
        {
            "title": "Chipmaker TSMC’s upbeat outlook fuels hopes for AI spending",
            "description": "Artificial intelligence to continue driving growth for Taiwan Semiconductor Manufacturing, chipmaker to Apple and Nvidia, firm says. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/chipmaker-tsmcs-outlook-fuels-hopes-ai-spending",
            "publishedAt": "2025-01-16T16:07:18Z"
        }
    ],
    "2025-01-09": [
        {
            "title": "KRAFTON Showcases AI Model ‘CPC’ Built with NVIDIA ACE at CES 2025",
            "description": "Shaping the future of gaming with KRAFTON’s AI technology and NVIDIA Hands-on demo features CPC technology applied to the PUBG IP Franchise and inZOI LAS VEGAS — KRAFTON (CEO Changhan ‘CH’ Kim) set a new milestone for the global gaming industry with the intro…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/krafton-showcases-ai-model-cpc-built-with-nvidia-ace-at-ces-2025",
            "publishedAt": "2025-01-09T02:46:29Z"
        }
    ],
    "2025-01-15": [
        {
            "title": "Nvidia’s $3-trillion rally is on edge. Should investors be worried?",
            "description": "Nvidia shares have dropped for five-straight sessions, shedding 12% since hitting a record on Jan. 6. Should investors be nervous? Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/nvidia-rally-on-edge",
            "publishedAt": "2025-01-15T14:16:15Z"
        }
    ],
    "2025-01-27": [
        {
            "title": "Nvidia, ASML Plunge as DeepSeek Triggers Tech Stock Selloff",
            "description": "Nvidia Corp. and ASML Holding NV shares plunged early Monday as Chinese artificial intelligence startup DeepSeek appeared to provide comparable performance to Western chatbots at a fraction of the price.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/nvidia-asml-plunge-as-deepseek-triggers-tech-stock-selloff",
            "publishedAt": "2025-01-27T10:04:02Z"
        },
        {
            "title": "Why DeepSeek Sent Nvidia, Other Tech Stocks Tumbling",
            "description": "Today on the Big Take: Why the rise of China’s DeepSeek AI company disrupted global markets — and how it could change the way the US approaches AI.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/why-deepseek-sent-nvidia-other-tech-stocks-tumbling",
            "publishedAt": "2025-01-27T23:52:58Z"
        },
        {
            "title": "World’s Richest People Lose $108 Billion After DeepSeek Selloff",
            "description": "The world’s 500 richest people, led by Nvidia Corp. co-founder Jensen Huang, lost a combined $108 billion on Monday as a tech-led selloff tied to Chinese AI developer DeepSeek sent major indices plunging.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/worlds-richest-people-lose-108-billion-after-deepseek-selloff",
            "publishedAt": "2025-01-27T22:06:16Z"
        },
        {
            "title": "Nvidia, Nasdaq futures plunge as DeepSeek triggers tech stock selloff",
            "description": "Chinese AI startup DeepSeek appears to provide comparable performance to Western chatbots at a fraction of the price. Read more",
            "source": "Financial Post",
            "url": "https://financialpost.com/technology/nvidia-plunges-deepseek-triggers-tech-stock-selloff",
            "publishedAt": "2025-01-27T10:04:02Z"
        }
    ],
    "2025-01-23": [
        {
            "title": "Stock Rally Flags With S&P 500 on Brink of Record: Markets Wrap",
            "description": "US stocks are set to open lower after Nvidia Corp.’s main supplier of high-bandwidth memory gave a cautious spending outlook, which sent global chipmaker shares lower.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/stock-rally-flags-with-sp-500-on-brink-of-record-markets-wrap",
            "publishedAt": "2025-01-23T14:13:40Z"
        }
    ],
    "2025-01-21": [
        {
            "title": "EU to Raise Biden’s AI Chip Curbs with Trump Administration",
            "description": "The European Union will raise concerns with the US over a decision to restrict the export of artificial intelligence chips from the likes of Nvidia Corp. to some of its member states, according to people familiar with the matter.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/eu-to-raise-bidens-ai-chip-curbs-with-trump-administration",
            "publishedAt": "2025-01-21T10:17:03Z"
        },
        {
            "title": "Brand Finance Global 500 2025: Apple Is the Most Valuable Brand in the World, NVIDIA Enters Top Ten",
            "description": "LONDON — Apple is once again the world’s most valuable brand. Brand Finance, the world’s leading brand valuation consultancy, values Apple’s brand at USD574.5 billion, ahead of second-placed Microsoft (USD461 billion). According to Brand Finance’s research, f…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/brand-finance-global-500-2025-apple-is-the-most-valuable-brand-in-the-world-nvidia-enters-top-ten",
            "publishedAt": "2025-01-21T15:28:59Z"
        }
    ],
    "2025-01-26": [
        {
            "title": "Selloff gets ugly as Nvidia heads for worst market-cap loss for a single stock in market history",
            "description": "Nvidia, the poster child of the AI frenzy, is headed toward the worst market-cap loss for a single stock in market history. Read more",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/deepseek-selloff-gets-ugly-nvidia-extends-loss",
            "publishedAt": "2025-01-26T23:03:43Z"
        }
    ],
    "2025-02-12": [
        {
            "title": "Nvidia Shares No Longer Bulletproof as DeepSeek Fears Linger",
            "description": "Nvidia Corp. investors have typically rushed to buy the stock on any dips. But the mood since the DeepSeek-driven rout has been different, signaling that fears of a slowdown in AI spending aren’t going away.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/nvidia-shares-no-longer-bulletproof-as-deepseek-fears-linger",
            "publishedAt": "2025-02-12T12:41:01Z"
        },
        {
            "title": "Nvidia shares no longer bulletproof as DeepSeek fears linger",
            "description": "Increasing investor caution about AI spending vies with optimists buying the dip. Read more on this",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/nvidia-shares-no-longer-bulletproof-as-deepseek-fears-linger",
            "publishedAt": "2025-02-12T12:41:01Z"
        }
    ],
    "2025-02-07": [
        {
            "title": "RTX 5090 buying frenzy: Scramble for new Nvidia gaming chips causes chaos in Tokyo",
            "description": "An electronics store in Tokyo has apologized after hundreds of Chinese buyers who flocked there to get their hands on the latest Nvidia gaming chips brought mayhem to the neighborhood.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/02/06/tech/tokyo-nvidia-gaming-chips-buy-frenzy-chaos-intl-hnk/index.html",
            "publishedAt": "2025-02-07T04:25:59Z"
        }
    ],
    "2025-02-24": [
        {
            "title": "Nvidia Earnings, Inflation: What to Watch This Week",
            "description": "Last, but not least. The final member of the so-called Magnificent Seven tech stocks to report in this earnings season is Nvidia, which will update investors late Wednesday.Those results, from the semiconductor company at the center of the artificial-intellig…",
            "source": "The Wall Street Journal",
            "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp500-nasdaq-02-24-2025/card/nvidia-earnings-inflation-what-to-watch-this-week-WOLXuHPDYf6Pmtjvzmw7",
            "publishedAt": "2025-02-24T08:13:11Z"
        },
        {
            "title": "Options Traders Line Up Hedges Before Pivotal Nvidia Earnings",
            "description": "Even before Friday’s slide jolted the US stock market out of its calm, some traders were preparing for unrest.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/options-traders-line-up-hedges-before-pivotal-nvidia-earnings",
            "publishedAt": "2025-02-24T03:39:51Z"
        }
    ],
    "2025-02-26": [
        {
            "title": "Nvidia sales surge in Q4 on demand for AI chips",
            "description": "Nvidia Corp. reported a surge in fourth-quarter profit and sales as demand for its AI chips continued to grow. Find out more.",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/nvidia-sales-surge-q4-demand-ai-chips",
            "publishedAt": "2025-02-26T21:52:13Z"
        },
        {
            "title": "Republic of Gamers Announces Next-Gen RTX 50 Series Laptop Lineup – Now Available for Pre-Order in Canada",
            "description": "ROG continues to set the standard of gaming with its powerful laptop lineup equipped with NVIDIA RTX 50 Series of GPU’s TORONTO, Feb. 25, 2025 (GLOBE NEWSWIRE) — ASUS Republic of Gamers (ROG) announced the arrival of its 2025 NVIDIA® RTX™ Laptop GPU line-up o…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/republic-of-gamers-announces-next-gen-rtx-50-series-laptop-lineup-now-available-for-pre-order-in-canada",
            "publishedAt": "2025-02-26T00:54:38Z"
        },
        {
            "title": "Asian Shares Set to Fall, Nvidia Gains on Forecast: Markets Wrap",
            "description": "Asian equities were set to decline Thursday as new tariff details from US President Donald Trump extended sluggish demand for risk across global markets. Nvidia Corp.’s shares rose in after-hours trading following a bullish revenue forecast.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/asian-shares-set-to-fall-nvidia-gains-on-forecast-markets-wrap",
            "publishedAt": "2025-02-26T23:08:34Z"
        },
        {
            "title": "Wall Street is anxiously watching Nvidia earnings again. What to know, by the numbers",
            "description": "Wall Street is once again fixated on Nvidia, as the main player in the artificial intelligence mania is set to report earnings after the bell Wednesday and give an update on demand for its semiconductors, which are used to power AI applications. This will be …",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/wall-street-is-anxiously-watching-nvidia-earnings-again-what-to-know-by-the-numbers",
            "publishedAt": "2025-02-26T15:10:33Z"
        }
    ],
    "2025-02-25": [
        {
            "title": "Why Nvidia’s earnings are important to the entire U.S. stock market",
            "description": "LOS ANGELES (AP) — Sales of Nvidia’s artificial intelligence chip Blackwell will be top of mind when the company releases its latest financial results Wednesday, with analysts eyeing future demand amid a Chinese upstart’s claim that it can train competitive A…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/why-nvidias-earnings-are-important-to-the-entire-u-s-stock-market",
            "publishedAt": "2025-02-25T09:04:46Z"
        }
    ],
    "2025-02-27": [
        {
            "title": "Nvidia and Salesforce leave bulls wanting as AI trade stalls",
            "description": "Investors hoping that Nvidia Corp.’s earnings would rejuvenate the AI trade didn’t exactly get the report they wanted. Find out more.",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/nvidia-salesforce-bulls-wanting-ai-trade-stalls",
            "publishedAt": "2025-02-27T18:54:13Z"
        }
    ],
    "2025-03-03": [
        {
            "title": "Nvidia Falls Back to its DeepSeek Discount",
            "description": "For a nearly $3 trillion company, Nvidia sure is looking cheap these days.The broad market’s tariff-induced selloff on Monday hit the AI titan particularly hard. Nvidia’s share price slid nearly 9% to log the worst performance of the U.S. megacap tech stocks …",
            "source": "The Wall Street Journal",
            "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp500-nasdaq-live-03-03-2025/card/nvidia-falls-back-to-its-deepseek-discount-86pXOP6o7r3xbwFoXfrb",
            "publishedAt": "2025-03-03T21:26:15Z"
        }
    ],
    "2025-03-13": [
        {
            "title": "Rockwell Automation Showcases Emulate3D Factory Test for the First Time at NVIDIA GTC 2025",
            "description": "Enterprise-scale digital twins unlock new possibilities for virtual controls testing MILWAUKEE — Rockwell Automation (NYSE:ROK), the world’s largest company dedicated to industrial automation and digital transformation, will debut its new Emulate3D® Factory T…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/rockwell-automation-showcases-emulate3d-factory-test-for-the-first-time-at-nvidia-gtc-2025",
            "publishedAt": "2025-03-13T11:11:54Z"
        }
    ],
    "2025-03-18": [
        {
            "title": "NetApp Storage Now Validated for NVIDIA DGX SuperPOD, NVIDIA Cloud Partners, and NVIDIA-Certified Systems",
            "description": "NetApp’s rich data management capabilities accelerate AI innovation for customers SAN JOSE, Calif. — NetApp® (NASDAQ: NTAP), the intelligent data infrastructure company, today announced that NVIDIA has validated high-performance NetApp enterprise storage syst…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/netapp-storage-now-validated-for-nvidia-dgx-superpod-nvidia-cloud-partners-and-nvidia-certified-systems",
            "publishedAt": "2025-03-18T20:07:51Z"
        },
        {
            "title": "Vultr Announces Early Availability of NVIDIA HGX B200 Worldwide",
            "description": "State-of-the-art NVIDIA Blackwell GPUs empower enterprises with a new level of performance for AI training, local tuning, and global inference WEST PALM BEACH, Fla. — Vultr, the world’s largest privately-held cloud infrastructure company, today announced it i…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/vultr-announces-early-availability-of-nvidia-hgx-b200-worldwide",
            "publishedAt": "2025-03-18T20:18:02Z"
        },
        {
            "title": "NetApp Fuels Future of Agentic AI Reasoning Solutions with NVIDIA AI Data Platform",
            "description": "NVIDIA-powered data agents coming to NetApp ONTAP will speed inference SAN JOSE, Calif. — NetApp® (NASDAQ: NTAP), the intelligent data infrastructure company, today announced it is advancing the state of the art in agentic AI with intelligent data infrastruct…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/netapp-fuels-future-of-agentic-ai-reasoning-solutions-with-nvidia-ai-data-platform",
            "publishedAt": "2025-03-18T20:06:43Z"
        },
        {
            "title": "Gatik to Accelerate Mass Production of SAE Level 4 (L4) Production-Ready Autonomous Trucks, Built on NVIDIA In-Vehicle Compute",
            "description": "The collaboration will see NVIDIA next-generation accelerated compute integrated into Gatik’s industry-leading autonomous technology, facilitating the production of commercial-grade medium-duty autonomous trucks at scale MOUNTAIN VIEW, Calif. — Gatik, the lea…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/gatik-to-accelerate-mass-production-of-sae-level-4-l4-production-ready-autonomous-trucks-built-on-nvidia-in-vehicle-compute",
            "publishedAt": "2025-03-18T20:07:47Z"
        },
        {
            "title": "Telus, Nvidia announce plans to develop ’sovereign AI factory’ in Quebec",
            "description": "Telus Corp. and Nvidia Corp. announced plans to build what they call a \"sovereign AI factory\" in eastern Quebec. Find out more.",
            "source": "Financial Post",
            "url": "https://financialpost.com/technology/telus-nvidia-develop-sovereign-ai-factory-quebec",
            "publishedAt": "2025-03-18T20:02:12Z"
        },
        {
            "title": "Telus, Nvidia announce plans to develop ‘sovereign AI factory’ in Quebec",
            "description": "VANCOUVER — Canadian telecommunications giant Telus and U.S. artificial intelligence tech heavyweight Nvidia have announced plans to build what they call a “sovereign AI factory” in eastern Quebec. The companies say they will provide Canadian businesses and r…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/telus-nvidia-announce-plans-to-develop-sovereign-ai-factory-in-quebec",
            "publishedAt": "2025-03-18T20:02:12Z"
        },
        {
            "title": "SoftServe Prepares Enterprises for Next AI Stages with New Agentic AI Solution at NVIDIA GTC",
            "description": "SoftServe QA Agent accelerates QA processes with AI test automation AUSTIN, Texas, March 18, 2025 (GLOBE NEWSWIRE) — SoftServe, a premier IT consulting and digital services provider, today introduced the SoftServe QA Agent, an agentic AI solution aiming to ac…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/softserve-prepares-enterprises-for-next-ai-stages-with-new-agentic-ai-solution-at-nvidia-gtc",
            "publishedAt": "2025-03-18T20:01:37Z"
        },
        {
            "title": "OpenAI’s First Stargate Site to Hold Up to 400,000 Nvidia Chips",
            "description": "The first data center complex for OpenAI’s $100 billion Stargate infrastructure venture will have space for as many as 400,000 of Nvidia Corp.’s powerful AI chips — an amount that, if filled, would make it one of the largest known clusters of artificial intel…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/openais-first-stargate-site-to-hold-up-to-400000-nvidia-chips",
            "publishedAt": "2025-03-18T18:27:35Z"
        },
        {
            "title": "Nvidia CEO Jensen Huang unveils new Rubin AI chips at GTC 2025",
            "description": "Nvidia founder Jensen Huang kicked off the company’s artificial intelligence developer conference on Tuesday by telling a crowd of thousands that AI is going through “an inflection point.” At GTC 2025, heralded as “AI Woodstock,” Huang focused his keynote on …",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/nvidia-ceo-jensen-huang-unveils-new-rubin-ai-chips-at-gtc-2025",
            "publishedAt": "2025-03-18T19:28:24Z"
        },
        {
            "title": "Magna and NVIDIA Team Up to Advance Next-Gen Automotive Technologies",
            "description": "Magna to integrate NVIDIA DRIVE AGX, built on DRIVE Thor SoC, for next-generation vehicle intelligence Collaboration to deliver AI-powered, scalable solutions for ADAS and autonomous driving systems, enabling software-defined vehicles In-vehicle accelerated c…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/magna-and-nvidia-team-up-to-advance-next-gen-automotive-technologies",
            "publishedAt": "2025-03-18T20:01:32Z"
        },
        {
            "title": "Zoom Named to Fast Company’s Annual List of the World’s Most Innovative Companies of 2025",
            "description": "The AI-first open work platform joins the ranks of Waymo, Nvidia, Duolingo, and more SAN JOSE, Calif., March 18, 2025 (GLOBE NEWSWIRE) — Zoom Communications, Inc. (NASDAQ: ZM), has been named to Fast Company’s prestigious list of the World’s Most Innovative C…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/zoom-named-to-fast-companys-annual-list-of-the-worlds-most-innovative-companies-of-2025",
            "publishedAt": "2025-03-18T11:30:45Z"
        },
        {
            "title": "24M Named a Fast Company 2025 World’s Most Innovative Company",
            "description": "Leading battery technology innovator recognized for fundamentally transforming battery safety, performance, cost and recyclability, 24M joins the ranks of Waymo, Nvidia, Duolingo, and more ORLANDO, Fla. — International Battery Seminar – At this week’s global …",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/24m-named-a-fast-company-2025-worlds-most-innovative-company",
            "publishedAt": "2025-03-18T15:57:28Z"
        },
        {
            "title": "AI is getting better at thinking like a person. Nvidia says its upgraded platform makes it even better",
            "description": "Nvidia on Tuesday announced an upgraded artificial intelligence platform, Blackwell Ultra, which it says will help apps reason and act on a user’s behalf – two capabilities that would take AI beyond chatbots further into real life.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/18/tech/nvidia-blackwell-ultra-ai-chip-gtc/index.html",
            "publishedAt": "2025-03-18T19:38:09Z"
        }
    ],
    "2025-03-21": [
        {
            "title": "Nvidia death cross has traders on high alert",
            "description": "Nvidia Corp. investors used to big announcements and equally large gains at the GTC conference were left wanting this go around. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/nvidia-death-cross-has-traders-on-high-alert",
            "publishedAt": "2025-03-21T16:39:30Z"
        }
    ],
    "2025-03-17": [
        {
            "title": "Nvidia investors look to CEO keynote to keep rebound going",
            "description": "Nvidia Corp. shareholders hope a keynote speech from Jensen Huang can deliver optimism to sustain the stock’s rebound. Read more here",
            "source": "Financial Post",
            "url": "https://financialpost.com/technology/tech-news/nvidia-investors-look-to-ceo-keynote",
            "publishedAt": "2025-03-17T14:29:09Z"
        }
    ],
    "2025-03-19": [
        {
            "title": "Itron to Bring NVIDIA-Powered Artificial Intelligence to the Grid Edge",
            "description": "Powering the Future of Utilities with High-Performance Edge Computing to Support Rapidly Increasing Demands of Grid Resilience, Customer Engagement and Affordability LIBERTY LAKE, Wash., March 19, 2025 (GLOBE NEWSWIRE) — Itron, Inc. (NASDAQ: ITRI), which is i…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/itron-to-bring-nvidia-powered-artificial-intelligence-to-the-grid-edge",
            "publishedAt": "2025-03-19T20:05:51Z"
        },
        {
            "title": "ETAP and Schneider Electric Unveil World’s First Digital Twin to Simulate AI Factory Power Requirements from Grid to Chip Level Using NVIDIA Omniverse",
            "description": "Digital twin provides enhanced insight and control over AI Factory electrical systems and power requirementsProduct collaboration integrates ETAP’s advanced Electrical Digital Twin technology with NVIDIA Omniverse™ Cloud APIsOperators can benefit from advance…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/etap-and-schneider-electric-unveil-worlds-first-digital-twin-to-simulate-ai-factory-power-requirements-from-grid-to-chip-level-using-nvidia-omniverse",
            "publishedAt": "2025-03-19T07:05:52Z"
        }
    ],
    "2025-03-24": [
        {
            "title": "ETAP and Schneider Electric Unveil World’s First Digital Twin to Simulate AI Factory Power Requirements from Grid to Chip Level Using NVIDIA Omniverse",
            "description": "Digital twin provides enhanced insight and control over AI Factory electrical systems and power requirements Product collaboration integrates ETAP’s advanced Electrical Digital Twin technology with NVIDIA Omniverse™ Cloud APIs Operators can benefit from advan…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/etap-and-schneider-electric-unveil-worlds-first-digital-twin-to-simulate-ai-factory-power-requirements-from-grid-to-chip-level-using-nvidia-omniverse-2",
            "publishedAt": "2025-03-24T13:02:26Z"
        }
    ],
    "2025-03-31": [
        {
            "title": "U.S. stocks post worst quarter compared with global markets since 2009",
            "description": "Markets saw wild swings Monday in the run-up to Wednesday's reciprocal tariff rollout as gold soared and Tesla and Nvidia slumped. Read on.",
            "source": "Financial Post",
            "url": "https://financialpost.com/news/stocks-wild-swings-tariff-rollout",
            "publishedAt": "2025-03-31T20:50:35Z"
        }
    ]
}