{
    "2025-02-03": [
        {
            "title": "South Korean appeals court upholds acquittal of Samsung chief Lee",
            "description": "SEOUL, South Korea (AP) — A South Korean appeals court on Monday upheld a lower court’s ruling that acquitted Samsung Electronics Chairman Lee Jae-yong of financial criminal charges over a contentious merger between Samsung affiliates that cemented his grip o…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/south-korean-appeals-court-upholds-acquittal-of-samsung-chief-lee",
            "publishedAt": "2025-02-03T10:18:31Z"
        }
    ],
    "2025-01-30": [
        {
            "title": "Samsung Gets Nvidia’s Nod on Less Advanced Version of AI Memory",
            "description": "Samsung Electronics Co. has obtained approval to supply a version of its fifth-generation high-bandwidth memory chips to Nvidia Corp., according to people familiar with the matter.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/samsung-gets-nvidias-nod-on-less-advanced-version-of-ai-memory",
            "publishedAt": "2025-01-30T23:58:39Z"
        }
    ],
    "2025-01-09": [
        {
            "title": "Samsung TV Karaoke, Powered by Stingray Karaoke, Wins Prestigious CES Innovation Award in Content & Entertainment",
            "description": "MONTREAL, Jan. 09, 2025 (GLOBE NEWSWIRE) — Stingray (TSX: RAY.A; RAY.B), an industry leader in music and video content distribution, business services, and advertising solutions, is thrilled to announce that Samsung TV Karaoke, powered by the Stingray Karaoke…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/samsung-tv-karaoke-powered-by-stingray-karaoke-wins-prestigious-ces-innovation-award-in-content-entertainment",
            "publishedAt": "2025-01-09T23:02:29Z"
        }
    ],
    "2025-01-10": [
        {
            "title": "Samsung Bioepis and Teva Enter into a Strategic Partnership for Commercialization of EPYSQLI® (eculizumab-aagh) in the United States",
            "description": "Marks a step forward in broadening treatment options for patients with paroxysmal nocturnal hemoglobinuria (PNH), atypical hemolytic uremic syndrome (aHUS) and generalized myasthenia gravis (gMG) in the U.S. Partnership supports Teva’s Pivot to Growth strateg…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/samsung-bioepis-and-teva-enter-into-a-strategic-partnership-for-commercialization-of-epysqli-eculizumab-aagh-in-the-united-states",
            "publishedAt": "2025-01-10T13:34:50Z"
        }
    ],
    "2025-01-27": [
        {
            "title": "LambdaTest Becomes the First in the Market to Launch Samsung Galaxy S25 Series for App Testing",
            "description": "Experience the power of seamless app testing on the Samsung Galaxy S25 series exclusively on LambdaTest, ahead of the official launch. NOIDA, India & SAN FRANCISCO — LambdaTest, a leading cloud-based unified testing platform, announced that the highly anticip…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/lambdatest-becomes-the-first-in-the-market-to-launch-samsung-galaxy-s25-series-for-app-testing",
            "publishedAt": "2025-01-27T16:09:28Z"
        }
    ],
    "2025-01-24": [
        {
            "title": "ASML Outlook Clouded by Intel, Samsung and China Chip Challenges",
            "description": "After sending shockwaves through the semiconductor industry following a third-quarter earnings miss, scrutiny is building ahead of ASML Holding NV’s results next week with uncertainty over the spending plans of its top clients.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/asml-outlook-clouded-by-intel-samsung-and-china-chip-challenges",
            "publishedAt": "2025-01-24T12:26:01Z"
        }
    ],
    "2025-01-22": [
        {
            "title": "Samsung banks on AI expansion to drive demand for S25 phones",
            "description": "Samsung Electronics Co. is banking an AI overhaul and tweaked hardware designs will sell its new Galaxy S25 smartphones. Read here for more",
            "source": "Financial Post",
            "url": "https://financialpost.com/technology/tech-news/samsung-ai-expansion-s25-phones",
            "publishedAt": "2025-01-22T20:14:32Z"
        },
        {
            "title": "Samsung aims to turn its next generation of Galaxy smartphones into AI companions",
            "description": "SAN JOSE, Calif. (AP) — Samsung is injecting another dose of artificial intelligence into its next lineup of Galaxy smartphones, escalating an effort to simplify people’s lives while deepening their dependence on a device that accompanies them almost everywhe…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/samsung-aims-to-turn-its-next-generation-of-galaxy-smartphones-into-ai-companions",
            "publishedAt": "2025-01-22T18:52:50Z"
        }
    ],
    "2025-01-23": [
        {
            "title": "Ex-Google, Meta execs building emotionally aware AI sales agents",
            "description": "Former engineering leads from Google, Meta and Samsung have launched a startup to build emotionally aware AI sales agents. Read more here",
            "source": "Financial Post",
            "url": "https://financialpost.com/technology/building-emotionally-aware-ai-sales-agents",
            "publishedAt": "2025-01-23T17:48:04Z"
        }
    ],
    "2025-02-25": [
        {
            "title": "Samsung Canada Expands Retail Presence with Immersive New Store at Scarborough Town Centre",
            "description": "The new location offers hands-on experiences with innovative technology and expert insights MISSISSAUGA, Ontario — Samsung Electronics Canada is excited to announce the grand opening of its new Samsung Experience Store at Scarborough Town Centre (STC), on Fri…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/samsung-canada-expands-retail-presence-with-immersive-new-store-at-scarborough-town-centre",
            "publishedAt": "2025-02-25T22:38:06Z"
        },
        {
            "title": "Clicks brings its award-winning iPhone keyboard case to Google, Motorola and Samsung smartphones",
            "description": "Smart keyboard accessory offers a premium typing experience, added screen real-estate and powerful keyboard shortcuts. Available to pre-order today from USD $49 LONDON, Feb. 25, 2025 (GLOBE NEWSWIRE) — Clicks Technology today announced the first three Clicks …",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/clicks-brings-its-award-winning-iphone-keyboard-case-to-google-motorola-and-samsung-smartphones",
            "publishedAt": "2025-02-25T17:03:38Z"
        }
    ],
    "2025-03-05": [
        {
            "title": "Samsung Mulls US Battery Plant Despite Trump Anti-EV Stance",
            "description": "South Korea’s Samsung SDI Co. said it’s weighing the idea of another manufacturing plant in the US, signaling optimism about the market’s growth despite President Donald Trump rolling back subsidies for electric vehicles.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/samsung-mulls-us-battery-plant-despite-trump-anti-ev-stance",
            "publishedAt": "2025-03-05T08:09:01Z"
        },
        {
            "title": "Trump Puts Spotlight on South Korean ‘Higher-Than-China’ Tariffs",
            "description": "President Donald Trump pointed to South Korea as a country with more unfair tariffs against American products than China, while slamming the handing out of subsidies for foreign chipmakers like Samsung Electronics Co.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/trump-puts-spotlight-on-south-korean-higher-than-china-tariffs",
            "publishedAt": "2025-03-05T06:06:57Z"
        }
    ],
    "2025-03-14": [
        {
            "title": "Samsung SDI to Sell $1.4 Billion Shares for Battery Plants",
            "description": "Samsung SDI Co. will raise 2 trillion won ($1.4 billion) selling new shares to fund investments in US and European facilities, as the South Korean battery maker bets on long-term growth of the electric-vehicle industry.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/samsung-sdi-to-sell-1-4-billion-shares-for-battery-plants",
            "publishedAt": "2025-03-14T01:46:25Z"
        }
    ],
    "2025-03-25": [
        {
            "title": "Han Jong-Hee: Samsung co-CEO dies at 63",
            "description": "Samsung Electronics co-CEO Han Jong-Hee died from cardiac arrest on Tuesday, according to a spokesperson for the South Korean tech giant. Han was 63.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/24/tech/samsung-co-ceo-han-jong-hee-death-intl-hnk/index.html",
            "publishedAt": "2025-03-25T01:14:55Z"
        }
    ]
}