{
    "2025-02-06": [
        {
            "title": "German Coal Generation Jumps to One-Year High as Wind Plunges",
            "description": "Germany’s coal-fired power generation surged to the highest level in more than a year, as slumping wind speeds sap the country’s renewable energy output.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/german-coal-generation-jumps-to-one-year-high-as-wind-plunges",
            "publishedAt": "2025-02-06T10:27:25Z"
        },
        {
            "title": "Saputo Reports Financial Results for the Third Quarter of Fiscal 2025 Ended December 31, 2024",
            "description": "MONTRÉAL, Feb. 06, 2025 (GLOBE NEWSWIRE) — Saputo Inc. (TSX: SAP) (we, Saputo or the Company) reported today its financial results for the third quarter of fiscal 2025, which ended on December 31, 2024. All amounts in this news release are in millions of Cana…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/saputo-reports-financial-results-for-the-third-quarter-of-fiscal-2025-ended-december-31-2024",
            "publishedAt": "2025-02-06T22:54:31Z"
        }
    ],
    "2025-02-03": [
        {
            "title": "Metals Tumble as Trump Tariffs Raise Inflation, Growth Fears",
            "description": "Copper, aluminum and iron ore led metals lower after President Donald Trump imposed tariffs on China, Canada and Mexico, threatening a trade war that could sap global economic growth.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/metals-tumble-as-trump-tariffs-raise-inflation-growth-fears",
            "publishedAt": "2025-02-03T03:28:18Z"
        }
    ],
    "2025-01-28": [
        {
            "title": "Rimini Street to Report Fourth Quarter and Fiscal Year 2024 Financial Results on February 27, 2025",
            "description": "LAS VEGAS — Rimini Street, Inc. (Nasdaq: RMNI), a global provider of end-to-end enterprise software support and innovation solutions, the leading third-party support provider for Oracle, SAP and VMware software, today announced it will report earnings after m…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/rimini-street-to-report-fourth-quarter-and-fiscal-year-2024-financial-results-on-february-27-2025",
            "publishedAt": "2025-01-28T14:18:40Z"
        }
    ],
    "2025-01-15": [
        {
            "title": "AuditBoard Appoints Former SAP and Growth Company Executive April Crichlow as Chief Marketing Officer",
            "description": "New executive brings high-growth, enterprise experience at scale to fuel customer-focused, international expansion LOS ANGELES — AuditBoard, the leading cloud-based platform transforming audit, risk, ESG, and InfoSec management, today announced the appointmen…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/auditboard-appoints-former-sap-and-growth-company-executive-april-crichlow-as-chief-marketing-officer",
            "publishedAt": "2025-01-15T14:06:41Z"
        }
    ],
    "2025-01-14": [
        {
            "title": "Procurify Appoints Jeffrey Hardy as Chief Revenue Officer",
            "description": "Experienced SAP executive tapped to lead revenue growth and enhance customer experience. VANCOUVER, British Columbia — Procurify, the leading AI-powered platform for procurement, accounts payable (AP), expense, and payment solutions designed for mid-market or…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/procurify-appoints-jeffrey-hardy-as-chief-revenue-officer",
            "publishedAt": "2025-01-14T17:09:35Z"
        }
    ],
    "2025-01-16": [
        {
            "title": "Saputo Inc.: Fiscal 2025 Third Quarter Results",
            "description": "MONTRÉAL, Jan. 16, 2025 (GLOBE NEWSWIRE) — Saputo will release its fiscal 2025 third quarter financial results on Thursday, February 6, 2025. A press release will be issued after markets close, and a conference call is scheduled on Friday, February 7, 2025, a…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/saputo-inc-fiscal-2025-third-quarter-results",
            "publishedAt": "2025-01-16T15:00:43Z"
        }
    ],
    "2025-01-23": [
        {
            "title": "Juicy US Yields May Sap Funding Desperately Needed in Emerging-Market Climate Finance",
            "description": "Persistently high US bond yields will force private investors to turn their backs on emerging markets desperately in need of financing to fight global warming.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/juicy-us-yields-may-sap-funding-desperately-needed-in-emerging-market-climate-finance",
            "publishedAt": "2025-01-23T06:25:59Z"
        }
    ],
    "2025-02-07": [
        {
            "title": "Oil Set for Weekly Drop as Trump Tariffs Outweigh Iran Sanctions",
            "description": "Oil headed for a third weekly decline as worries that President Donald Trump’s tariffs on China will sap demand outweighed the new US administration’s first round of sanctions against Iran.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/oil-set-for-weekly-drop-as-trump-tariffs-outweigh-iran-sanctions",
            "publishedAt": "2025-02-07T01:07:55Z"
        }
    ],
    "2025-03-06": [
        {
            "title": "Introducing Spinnaker Cloud Managed Services: Empowering Organizations to Modernize on Their Own Terms and Timeline",
            "description": "-New integrated solution supports Oracle and SAP environments across both legacy and cloud platforms- -Provides seamless cloud support that complements legacy systems, so organizations don’t have to choose between modernization and stability- DENVER — Spinnak…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/introducing-spinnaker-cloud-managed-services-empowering-organizations-to-modernize-on-their-own-terms-and-timeline",
            "publishedAt": "2025-03-06T14:10:32Z"
        }
    ],
    "2025-03-12": [
        {
            "title": "NTT DATA becomes a Global Managed Service Provider in the SAP PartnerEdge, Run Program Track",
            "description": "NTT DATA will offer packaged value-add services based on cloud solutions from SAP LONDON — NTT DATA, a global digital business and technology services leader, today announces it has joined the SAP PartnerEdge program with a “Run” focus as a managed service pr…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/ntt-data-becomes-a-global-managed-service-provider-in-the-sap-partneredge-run-program-track",
            "publishedAt": "2025-03-12T12:16:52Z"
        }
    ],
    "2025-03-17": [
        {
            "title": "KNAPP Releases Best of Breed and Best of Suite Software at ProMat 2025",
            "description": "KiSoft and SAP by KNAPP Featured in Newest Release ATLANTA — KNAPP, the reliable technology partner for value chain innovation, is proud to announce the release of the latest versions of KiSoft and SAP by KNAPP at ProMat 2025. Based on client preferences, the…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/knapp-releases-best-of-breed-and-best-of-suite-software-at-promat-2025",
            "publishedAt": "2025-03-17T16:33:59Z"
        }
    ],
    "2025-03-20": [
        {
            "title": "NHL launches a front office iPad app to modernize roster, contract and salary cap info for teams",
            "description": "MANALAPAN, Fla. (AP) — The NHL has launched a front office app that modernizes the league’s roster, contract and salary cap information. The league worked with SAP to develop an app for Apple iPads that streamlines Central Registry data, cap and long-term inj…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/nhl-launches-a-front-office-ipad-app-to-modernize-roster-contract-and-salary-cap-info-for-teams",
            "publishedAt": "2025-03-20T13:15:41Z"
        }
    ],
    "2025-03-18": [
        {
            "title": "Saputo Inc. at the CIBC Retail and Consumer Conference",
            "description": "MONTRÉAL, March 18, 2025 (GLOBE NEWSWIRE) — Saputo Inc. (TSX:SAP) today announced that Mr. Carl Colizza, President and CEO, will present at the CIBC Retail and Consumer Conference in Toronto, Ontario, on Wednesday, March 26, 2025, at 8:30 a.m. (Eastern Time).…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/saputo-inc-at-the-cibc-retail-and-consumer-conference",
            "publishedAt": "2025-03-18T14:03:18Z"
        }
    ],
    "2025-03-27": [
        {
            "title": "Asian Stocks Decline as Trump Tariffs Sap Risk: Markets Wrap",
            "description": "Asian equities dropped after President Donald Trump imposed a 25% tariff on US auto imports, prompting investors to pare bets on riskier investments due to concerns about growth in the world’s largest economy. Shares of automakers slid.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/asian-stocks-decline-as-trump-tariffs-sap-risk-markets-wrap",
            "publishedAt": "2025-03-27T06:21:46Z"
        }
    ]
}