{
    "2025-01-31": [
        {
            "title": "Chrystia Freeland says Canada should target Elon Musk’s Tesla in retaliation to tariffs",
            "description": "Chrystia Freeland says Ottawa should target Tesla vehicles as part of its tariff retaliation package to send a message. Read here for more",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/chrystia-freeland-target-elon-musks-tesla-tariffs",
            "publishedAt": "2025-01-31T19:44:41Z"
        },
        {
            "title": "Tesla’s ‘Supercharged Narrative’ Shreds Stock’s Valuation Models",
            "description": "Tesla Inc.’s quarterly results this week drove home the lesson that profit and sales numbers don’t seem to matter much for this stock anymore. Instead, it’s Elon Musk’s narrative that’s wooing investors at the moment.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/teslas-supercharged-narrative-shreds-stocks-valuation-models",
            "publishedAt": "2025-01-31T10:53:59Z"
        }
    ],
    "2025-02-05": [
        {
            "title": "Tesla Sales Plunge 59% in Germany to Lowest Level in Years",
            "description": "Tesla Inc.’s sales plummeted 59% last month in Germany, adding to indications that Chief Executive Officer’s Elon Musk political activities are hurting the carmaker’s business in major electric vehicle markets.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/tesla-sales-plunge-59-in-germany-to-lowest-level-in-years",
            "publishedAt": "2025-02-05T17:36:22Z"
        }
    ],
    "2025-02-03": [
        {
            "title": "Investors are betting Musk and Tesla will make a fortune under Trump even as threats mount",
            "description": "NEW YORK (AP) — For Elon Musk fans, it’s the half a trillion-dollar bet. That is how much the stock market value of Tesla has rocketed since the presidential election, a vertiginous climb uninterrupted in recent days despite a disappointing financial report t…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/investors-are-betting-musk-and-tesla-will-make-a-fortune-under-trump-even-as-threats-mount",
            "publishedAt": "2025-02-03T13:25:59Z"
        }
    ],
    "2025-02-04": [
        {
            "title": "Tesla Supplier Panasonic to Cut Costs to Support Shift Into AI",
            "description": "Panasonic Holdings Corp. is considering an overhaul of personnel and trimming underperforming businesses to lower fixed costs, part of a shift into more lucrative areas such as powering AI data centers.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/tesla-supplier-panasonic-to-cut-costs-to-support-shift-into-ai",
            "publishedAt": "2025-02-04T10:34:22Z"
        },
        {
            "title": "Ford’s F-150 Lightning Is Falling Behind Tesla’s Cybertruck in Deepening EV Crisis",
            "description": "The automaker has a plan to catch up to rivals rolling out high-performing, affordable electric vehicles. But first, it has to endure Trump tariff threats and its own version of EV hell.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/fords-f-150-lightning-is-falling-behind-teslas-cybertruck-in-deepening-ev-crisis",
            "publishedAt": "2025-02-04T11:20:05Z"
        }
    ],
    "2025-02-02": [
        {
            "title": "Elon Musk’s DOGE commission gains access to sensitive Treasury payment systems: AP sources",
            "description": "WASHINGTON (AP) — The Department of Government Efficiency, run by President Donald Trump’s billionaire adviser and Tesla CEO Elon Musk, has gained access to sensitive Treasury data including Social Security and Medicare customer payment systems, according to …",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/elon-musks-doge-commission-gains-access-to-sensitive-treasury-payment-systems-ap-sources",
            "publishedAt": "2025-02-02T02:19:36Z"
        }
    ],
    "2025-01-29": [
        {
            "title": "Tesla’s $600 Billion Run-Up Looks Past Major Risks to EV Growth",
            "description": "Tesla Inc. shares have nearly doubled in value since the last time the company reported earnings— a set-up that usually spells high expectations for upcoming results. But its car-selling business has become a sideshow to Elon Musk’s political prominence.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/teslas-600-billion-run-up-looks-past-major-risks-to-ev-growth",
            "publishedAt": "2025-01-29T11:22:25Z"
        },
        {
            "title": "Elon Musk focuses on robotaxi plans after Tesla earnings miss",
            "description": "Firm's rising stock suggests investors see past financial results and view shares as a proxy for its CEO's prospects, analysts say. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/elon-musk-focuses-robotaxi-plans",
            "publishedAt": "2025-01-29T21:57:33Z"
        },
        {
            "title": "Tesla's US$600 billion run-up looks past major risks to EV growth",
            "description": "Tesla has nearly doubled in value since the last earnings report, but its cars have become a sideshow to Elon Musk’s politics. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/tesla-looks-past-risks-ev-growth",
            "publishedAt": "2025-01-29T11:22:25Z"
        }
    ],
    "2025-01-16": [
        {
            "title": "Tesla’s Asian Rivals Pull Ahead in India’s Nascent EV Market",
            "description": "Suzuki Motor Corp.’s India unit, BYD Co. and VinFast Auto Ltd. are among carmakers gearing to showcase their new electric vehicles in New Delhi as the fight intensifies for the fastest-growing major automobile market where Tesla Inc. is conspicuous by its abs…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/teslas-asian-rivals-pull-ahead-in-indias-nascent-ev-market",
            "publishedAt": "2025-01-16T00:19:09Z"
        }
    ],
    "2025-01-15": [
        {
            "title": "Transportation secretary pick vows to buck any pressure to help Elon Musk in agency probes of Tesla",
            "description": "NEW YORK (AP) — Donald Trump’s pick to head the Transportation Department promised Wednesday to scrutinize Boeing’s safety issues, streamline regulations and not interfere in ongoing agency investigations into Elon Musk’s electric car company if confirmed as …",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/transportation-secretary-pick-vows-to-buck-any-pressure-to-help-elon-musk-in-agency-probes-of-tesla",
            "publishedAt": "2025-01-15T20:22:47Z"
        }
    ],
    "2025-01-17": [
        {
            "title": "Burning Teslas add to toxic pollution delaying L.A. return",
            "description": "As the smoke clears from Los Angeles wildfires, clean up efforts are being complicated by burnt-out electric and hybrid vehicles. Read more.",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/teslas-toxic-mix-pollution-delaying-la",
            "publishedAt": "2025-01-17T01:44:06Z"
        },
        {
            "title": "Burning Teslas Add to Toxic Mix of Pollution Delaying LA Return",
            "description": "As the smoke clears from devastating Los Angeles wildfires, efforts to clean up the affected areas are being complicated by burnt-out electric and hybrid vehicles and home-battery storage systems.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/burning-teslas-add-to-toxic-mix-of-pollution-delaying-la-return",
            "publishedAt": "2025-01-17T01:44:06Z"
        }
    ],
    "2025-01-21": [
        {
            "title": "Tesla Slides, Space Stocks Soar After Trump’s Barrage of Orders",
            "description": "Shares of Tesla Inc. slumped Tuesday alongside other electric-vehicle makers, while space company stocks saw big gains, after President Donald Trump announced a series of policies that could have wide-ranging impacts on markets.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/tesla-slides-space-stocks-soar-after-trumps-barrage-of-orders",
            "publishedAt": "2025-01-21T18:40:11Z"
        },
        {
            "title": "Tesla slides, space stocks soar after Trump's barrage of orders",
            "description": "Trump ordered his administration to consider removing subsidies and policies favouring EVs, weighing on Elon Musk’s company. Keep reading.",
            "source": "Financial Post",
            "url": "https://financialpost.com/news/tesla-slides-space-stocks-soar-after-trumps-barrage-of-orders",
            "publishedAt": "2025-01-21T18:40:11Z"
        }
    ],
    "2025-01-24": [
        {
            "title": "French Ministers Warn EU Car-Emissions Rules Enrich China, Musk",
            "description": "French ministers are calling for the European Commission to immediately suspend standards for car emissions on the grounds that the regulation benefits Chinese manufacturers and Tesla Inc.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/french-ministers-warn-eu-car-emissions-rules-enrich-china-musk",
            "publishedAt": "2025-01-24T17:26:01Z"
        }
    ],
    "2025-01-22": [
        {
            "title": "Musk’s politics offer a sales opportunity for rival Polestar",
            "description": "The role Elon Musk is playing in politics is turning off many Tesla customers and creating an opening for rival Polestar. Read more here",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/musks-politics-opportunity-for-polestar",
            "publishedAt": "2025-01-22T15:09:30Z"
        }
    ],
    "2025-01-23": [
        {
            "title": "Tesla raising prices for its vehicles in Canada by up to $9,000 starting Feb. 1",
            "description": "TORONTO — Tesla Inc. is raising prices on its Canadian vehicles by thousands of dollars starting Feb.1 amid big shifts in incentives and rising trade tension. Prices for its Model 3 vehicle are increasing by up to $9,000, while prices for its Model Y, X and S…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/tesla-raising-prices-for-its-vehicles-in-canada-by-up-to-9000-starting-feb-1",
            "publishedAt": "2025-01-23T18:17:09Z"
        }
    ],
    "2025-02-07": [
        {
            "title": "Tesla Shares Set for Worst Week Since Election as Sales Plunge",
            "description": "While Elon Musk has been generating headline after headline for his efforts to reshape the US federal workforce, the stock of his electric-car company is on track for its worst weekly performance since the US presidential election.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/tesla-shares-set-for-worst-week-since-election-as-sales-plunge",
            "publishedAt": "2025-02-07T16:02:14Z"
        }
    ],
    "2025-02-12": [
        {
            "title": "Her parents were injured in a Tesla crash. She ended up having to pay Tesla damages",
            "description": "BEIJING (AP) — Zhang Yazhou was sitting in the passenger seat of her Tesla Model 3 when she said she heard her father’s panicked voice: The brakes don’t work! Approaching a red light, her father swerved around two cars before plowing into an SUV and a sedan a…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/her-parents-were-injured-in-a-tesla-crash-she-ended-up-having-to-pay-tesla-damages",
            "publishedAt": "2025-02-12T01:04:07Z"
        },
        {
            "title": "Takeaways: Tesla has sued Chinese customers and journalists – and won almost every time",
            "description": "BEIJING (AP) — Tesla has embraced an aggressive legal strategy in China to stifle its critics — suing its own customers. That’s left some Tesla owners desperate. Zhang Yazhou protested publicly that her Model 3’s brakes had failed and caused an accident in 20…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/takeaways-tesla-has-sued-chinese-customers-and-journalists-and-won-almost-every-time",
            "publishedAt": "2025-02-12T13:05:07Z"
        },
        {
            "title": "CATL, world’s biggest EV battery maker, seeks blockbuster Hong Kong listing",
            "description": "China’s Contemporary Amperex Technology (CATL), the world’s largest producer of batteries for electric vehicles and a supplier for Tesla, has applied for a listing in Hong Kong, setting sights on one of the city’s largest stock offerings in years.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/02/12/tech/hong-kong-catl-ipo-hnk-intl/index.html",
            "publishedAt": "2025-02-12T11:59:45Z"
        }
    ],
    "2025-02-11": [
        {
            "title": "Tesla unwind gives traders a way to hedge market selloff",
            "description": "As a rally in the shares of electric-vehicle maker Tesla Inc. rapidly unwinds, some market watchers spot a lucrative opportunity. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/tesla-unwind-hedge-market-selloff",
            "publishedAt": "2025-02-11T20:49:09Z"
        },
        {
            "title": "How Elon Musk’s crusade against government could benefit Tesla",
            "description": "WASHINGTON (AP) — Elon Musk has long railed against the U.S. government, saying a crushing number of federal investigations and safety programs have stymied Tesla, his electric car company, and its efforts to create fleets of robotaxis and other self-driving …",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/how-elon-musks-crusade-against-government-could-benefit-tesla",
            "publishedAt": "2025-02-11T05:12:21Z"
        }
    ],
    "2025-02-13": [
        {
            "title": "Tesla Supplier CNGR Said to Target $500 Million in Hong Kong Listing",
            "description": "Chinese battery-component producer CNGR Advanced Material Co. is working with Huatai Securities Co. and Morgan Stanley on its planned Hong Kong listing, according to people familiar with the matter.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/tesla-supplier-cngr-said-to-target-500-million-in-hong-kong-listing",
            "publishedAt": "2025-02-13T08:25:36Z"
        }
    ],
    "2025-02-14": [
        {
            "title": "Once proud fans, some Tesla owners in Canada embarrassed by company’s CEO",
            "description": "MONTREAL — Stephane Pascalon’s Tesla fan club brings people together to share their pride for the company’s cars, but that pride has turned into shame for some, and now the club plans to distribute hundreds of bumper stickers so owners can distance themselves…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/once-proud-fans-some-tesla-owners-in-canada-embarrassed-by-companys-ceo",
            "publishedAt": "2025-02-14T09:06:43Z"
        }
    ],
    "2025-02-17": [
        {
            "title": "Sheryl Crow sells her Tesla and donates proceeds to NPR | CNN",
            "description": "Sheryl Crow sells her Tesla and donates proceeds to NPR | CNNcnn.com",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/02/17/entertainment/sheryl-crow-sells-tesla-and-donates-money-to-npr/index.html",
            "publishedAt": "2025-02-17T16:01:17Z"
        },
        {
            "title": "Are Elon Musk’s politics costing Tesla sales? | CNN Business",
            "description": "Tesla sales are in an unprecedented slide. Competitors are rapidly gaining ground. There’s a lot of bad news for Tesla lately – but it’s unclear if the politics of its polarizing CEO, Elon Musk, are to blame.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/02/17/business/tesla-sales-elon-musk-politics/index.html",
            "publishedAt": "2025-02-17T12:18:35Z"
        }
    ],
    "2025-02-25": [
        {
            "title": "India Market Buzz: Tesla’s India Entry May Not Dent Local Firms, Analysts Say",
            "description": "Before the trading day starts we bring you a digest of the key news and events that are likely to move markets. Today we look at:",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/india-market-buzz-teslas-india-entry-may-not-dent-local-firms-analysts-say",
            "publishedAt": "2025-02-25T04:39:22Z"
        },
        {
            "title": "Tesla shares slump after European sales fall",
            "description": "Shares in the US electric carmaker dropped after European sales halved in January.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/cvgd9v3r69qo",
            "publishedAt": "2025-02-25T19:35:34Z"
        }
    ],
    "2025-02-26": [
        {
            "title": "Colorado woman with incendiary devices arrested following Tesla dealership vandalism",
            "description": "A Colorado woman has been arrested after a Tesla dealership in Loveland, Colorado, was vandalized several times, with incendiary devices discovered at the scene, according to a release from the Loveland Police Department on Wednesday.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/02/26/us/tesla-dealership-arrest-loveland-colorado/index.html",
            "publishedAt": "2025-02-26T17:29:23Z"
        }
    ],
    "2025-03-04": [
        {
            "title": "Driverless Uber rides now challenging Elon Musk’s Tesla in its backyard | CNN Business",
            "description": "Driverless Uber rides now challenging Elon Musk’s Tesla in its backyard | CNN Businesscnn.com",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/04/business/self-driving-uber-waymo-texas/index.html",
            "publishedAt": "2025-03-04T13:07:35Z"
        }
    ],
    "2025-03-01": [
        {
            "title": "‘Tesla Takedown’ protesters gather outside showrooms to rally against Elon Musk’s role with DOGE | CNN Business",
            "description": "Protesters gathered at more than 50 Tesla showrooms Saturday morning in protest of Elon Musk’s controversial role in slashing government.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/01/business/tesla-takedown-musk-doge/index.html",
            "publishedAt": "2025-03-01T23:02:04Z"
        }
    ],
    "2025-03-07": [
        {
            "title": "Tesla erases US$700 billion ‘Trump Bump’ as sales slide",
            "description": "A slide in Tesla Inc. on Friday is capping off a round trip of epic proportions in the company’s shares. Read here for more",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/tesla-erases-700-billion-trump-bump",
            "publishedAt": "2025-03-07T18:09:36Z"
        },
        {
            "title": "Oregon police investigate nighttime gunshots that shattered windows at a Tesla dealership",
            "description": "PORTLAND, Ore. (AP) — Police in Oregon said Thursday they are working with the FBI to investigate gunshots fired at a Tesla dealership overnight in the latest instance of vandalism at one of the company’s retail stores. No one was injured in the shooting in t…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/oregon-police-investigate-nighttime-gunshots-that-shattered-windows-at-a-tesla-dealership",
            "publishedAt": "2025-03-07T01:35:08Z"
        }
    ],
    "2025-03-06": [
        {
            "title": "Tesla Gets Tax Sweetener for Houston-Area Megapack Factory",
            "description": "A Houston-area county approved a tax abatement for Tesla Inc. to build out and operate a third megapack factory as the electric car maker expands its energy business.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/tesla-gets-tax-sweetener-for-houston-area-megapack-factory",
            "publishedAt": "2025-03-06T06:48:00Z"
        },
        {
            "title": "Wall Street is turning its back on Elon Musk | CNN Business",
            "description": "Liberals and government employees aren’t the only people angry with Elon Musk. Tesla’s plunging share price means many investors are angry, too.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/06/business/musk-trump-tesla-shares-slide/index.html",
            "publishedAt": "2025-03-06T12:00:53Z"
        }
    ],
    "2025-03-05": [
        {
            "title": "Does Tesla stand to benefit from North American tariffs?",
            "description": "The auto industry is one of the most vulnerable sectors to tariffs — but what about Tesla's EVs?",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/does-tesla-stand-to-benefit-from-north-american-tariffs",
            "publishedAt": "2025-03-05T16:04:12Z"
        }
    ],
    "2025-03-13": [
        {
            "title": "BC Hydro bans Tesla from charger rebate program as B.C. ramps up tariff response",
            "description": "VANCOUVER — British Columbia is ramping up its response to the trade war with the United States, with BC Hydro banning Tesla products from its electric vehicle rebate program and the government tabling legislation to combat the tariff threats. BC Hydro says o…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/bc-hydro-bans-tesla-from-charger-rebate-program-as-b-c-ramps-up-tariff-response",
            "publishedAt": "2025-03-13T18:28:12Z"
        },
        {
            "title": "BC Hydro bans Tesla from charger rebate program",
            "description": "BC Hydro says Tesla products have been removed from its electric vehicle rebate program as part of the fight against U.S. tariffs. Read more",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/bc-hydro-bans-tesla-charger-rebate-program",
            "publishedAt": "2025-03-13T18:27:40Z"
        },
        {
            "title": "Tesla rebates axed in B.C. as trade war widens",
            "description": "B.C. pulled government subsidies for people to install Tesla chargers, widening efforts to spurn US goods in the trade war. Find out more.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/tesla-rebates-axed-bc-trade-war-widens",
            "publishedAt": "2025-03-13T20:00:23Z"
        },
        {
            "title": "Tesla Warns It Faces Retaliation, Costs From Trump Trade War",
            "description": "Tesla Inc. is signaling concern over potential retaliatory moves by other countries as a trade war escalates in the wake of President Donald Trump’s moves to impose tariffs on a wide range of imports.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/tesla-warns-it-faces-retaliation-costs-from-trump-trade-war",
            "publishedAt": "2025-03-13T21:47:19Z"
        },
        {
            "title": "Tesla Rebates Axed in Canadian Province as Trade War Widens",
            "description": "British Columbia, Canada’s third most populous province, pulled government subsidies for people to install Tesla Inc. chargers, widening efforts to spurn US goods in a trade war with President Donald Trump.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/tesla-rebates-axed-in-canadian-province-as-trade-war-widens",
            "publishedAt": "2025-03-13T20:00:23Z"
        },
        {
            "title": "Elon Musk’s Tesla says it could be targeted by retaliatory tariffs | CNN Business",
            "description": "Tesla, the electric car company run by Elon Musk, said this week that retaliatory tariffs against US manufacturers could harm its operations and that the US should carefully consider its trade policies, a break from Musk’s ally President Donald Trump.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/13/business/elon-musk-tesla-retaliatory-tariffs/index.html",
            "publishedAt": "2025-03-13T23:55:13Z"
        }
    ],
    "2025-03-10": [
        {
            "title": "Tesla stock price tumbles on sales estimates pullback",
            "description": "Tesla Inc. shares plunged to their worst day in over four years, extending a slide in 2025 amid growing concerns about the company. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/tesla-stock-price-tumbles",
            "publishedAt": "2025-03-10T21:05:23Z"
        },
        {
            "title": "Police reporting acts of vandalism against Tesla facilities as anger against Musk mounts | CNN Business",
            "description": "Police across the United States are investigating a series of attacks on Tesla showrooms, charging stations and Tesla vehicles, as vitriol escalates against CEO Elon Musk.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/10/business/tesla-vandalism-protest-stock/index.html",
            "publishedAt": "2025-03-10T18:31:52Z"
        }
    ],
    "2025-03-12": [
        {
            "title": "Trump says attacks on Tesla stores are domestic terrorism",
            "description": "Donald Trump said protesters vandalizing Tesla’s showrooms and charging stations should be considered domestic terrorists. Read more here",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/trump-says-attacks-on-tesla-stores-domestic-terrorism",
            "publishedAt": "2025-03-12T13:26:04Z"
        },
        {
            "title": "Even Musk fans dash for the sidelines as Tesla in freefall",
            "description": "'Tesla is now a proxy for Trump, and unless the market is willing to reward Trump and Musk for their efforts the stock will keep going down'",
            "source": "Financial Post",
            "url": "https://financialpost.com/investing/musk-fans-dash-for-sidelines-tesla-freefall",
            "publishedAt": "2025-03-12T11:50:46Z"
        }
    ],
    "2025-03-11": [
        {
            "title": "Trump is buying a Tesla. A look at the harsh things he’s had to say about EVs over the years",
            "description": "WASHINGTON (AP) — President Donald Trump, who’s buying a Tesla to show loyalty to company CEO Elon Musk, has had plenty to say about electric vehicles over the years. Most of it is not good. Of course, Trump was once a sharp critic of Musk, too, which is espe…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/trump-is-buying-a-tesla-a-look-at-the-harsh-things-hes-had-to-say-about-evs-over-the-years",
            "publishedAt": "2025-03-11T17:46:33Z"
        },
        {
            "title": "Elon Musk’s self destruction",
            "description": "Musk's standing is dropping as fast as Tesla's stock price, but with signs of a \"Trump recession\", he may be a useful lightning rod. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/financial-times/elon-musks-self-destruction",
            "publishedAt": "2025-03-11T16:56:28Z"
        },
        {
            "title": "Donald Trump vows to 'buy a brand new Tesla' after stock slump",
            "description": "The US president blames \"radical left lunatics\" but analysts point to Tesla sales slump.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/cqjdg4x08ylo",
            "publishedAt": "2025-03-11T10:46:48Z"
        },
        {
            "title": "Tesla shares climb as Trump shows off a line of the vehicles in front of the White House",
            "description": "It was almost an extraordinary scene in front of the White House. As Tesla shares have been tanking since the year began, President Donald Trump held remarks outside of the White House with the company’s CEO and Department of Government Efficiency Head Elon M…",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/11/business/tesla-stock-trump-white-house/index.html",
            "publishedAt": "2025-03-11T20:54:19Z"
        },
        {
            "title": "Trump says he’ll buy a Tesla to support Elon Musk, whose companies are struggling | CNN Business",
            "description": "Elon Musk spent the weekend with President Donald Trump at Mar-a-Lago, getting a round-trip ride on Air Force One. While Musk has spent an increasing amount of time with Trump, three of his companies are having a rough go.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/11/media/elon-musk-companies-x-tesla-spacex/index.html",
            "publishedAt": "2025-03-11T10:23:42Z"
        }
    ],
    "2025-03-14": [
        {
            "title": "Trump tariffs: Elon Musk's Tesla raises concern over retaliation risk",
            "description": "The electric carmaker’s warning about tariffs comes despite its boss's key position in the Trump administration.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c201z4lv5xxo",
            "publishedAt": "2025-03-14T11:25:33Z"
        }
    ],
    "2025-03-15": [
        {
            "title": "As Tesla stock rebounds, protesters ramp up efforts to hurt Elon Musk | CNN Business",
            "description": "There will be more than 80 protests on Saturday and another 76 are already listed to take place through the end of April, according to the Tesla Takedown organizing website.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/15/business/elon-musk-tesla-demonstrations-doge/index.html",
            "publishedAt": "2025-03-15T22:05:06Z"
        }
    ],
    "2025-03-21": [
        {
            "title": "Tesla Vandalism Sparks Fury on the Right While Protests Escalate",
            "description": "Molotov cocktails at Tesla showrooms. Disturbing messages on Cybertrucks. Vandalism at charging stations.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/tesla-vandalism-sparks-fury-on-the-right-while-protests-escalate",
            "publishedAt": "2025-03-21T11:35:01Z"
        },
        {
            "title": "Used Teslas pile up in Canada as Musk embraces politics",
            "description": "Tesla experienced its \"highest-ever share” of trade-ins for new or used cars from dealerships selling other brands",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/used-teslas-pile-up-in-canada",
            "publishedAt": "2025-03-21T19:15:40Z"
        },
        {
            "title": "Elon Musk calls all-hands meeting at 9:30 at night to urge Tesla employees to hang on to their stock",
            "description": "Elon Musk tried to reassure Tesla employees after EV maker's stock plunged 40% this year. Read more",
            "source": "Financial Post",
            "url": "https://financialpost.com/transportation/autos/elon-musk-urges-tesla-employees-hang-on-to-stock",
            "publishedAt": "2025-03-21T11:42:58Z"
        },
        {
            "title": "Tesla’s fans buy up stock at pace never seen before",
            "description": "Tesla Inc.’s stock is in freefall. But one group is buying the electric-vehicle maker’s shares like never before: Elon Musk’s fans. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/teslas-fans-buy-up-stock",
            "publishedAt": "2025-03-21T16:10:16Z"
        },
        {
            "title": "Tesla vandals face up to 20 years in prison, says attorney general",
            "description": "The US attorney general said a wave of vandalism and arson attacks at Tesla dealerships is \"domestic terrorism\".",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c204yvv1eexo",
            "publishedAt": "2025-03-21T01:20:20Z"
        }
    ],
    "2025-03-20": [
        {
            "title": "Xcel Energy to Deploy Advanced Virtual Power Plant in Colorado with Itron and Tesla",
            "description": "Integration of Itron’s IntelliFLEX Aggregator DERMS Solution and Tesla Home Batteries Drives Grid Flexibility, Visibility and Control LIBERTY LAKE, Wash., March 20, 2025 (GLOBE NEWSWIRE) — Itron, Inc. (NASDAQ: ITRI), which is innovating new ways for energy pr…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/xcel-energy-to-deploy-advanced-virtual-power-plant-in-colorado-with-itron-and-tesla",
            "publishedAt": "2025-03-20T20:06:29Z"
        },
        {
            "title": "In latest blow to Tesla, regulators recall nearly all Cybertrucks",
            "description": "U.S. safety regulators on Thursday recalled virtually all Cybertrucks on the road, the eighth recall of the Tesla-made vehicles since deliveries to customers began just over a year ago. The National Highway Traffic Safety Administration’s recall, which covers…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/in-latest-blow-to-tesla-regulators-recall-nearly-all-cybertrucks",
            "publishedAt": "2025-03-20T18:09:28Z"
        },
        {
            "title": "Mercedes-Benz boss talks Tesla’s vulnerability",
            "description": "Mercedes-Benz has produced its most advanced vehicle just as Tesla's fall gave the company an opening to woo disgruntled buyers. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/mercedes-benz-boss-talks-teslas-vulnerability",
            "publishedAt": "2025-03-20T13:27:31Z"
        },
        {
            "title": "The used Tesla market is crumbling | CNN Business",
            "description": "As Elon Musk continues to take an outsized and controversial role in the US government, reports of harassment of Tesla owners and vandalism of showrooms and vehicles are on rise. That may, in part, be contributing to plunging resale values and interest in use…",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/20/business/even-used-teslas-are-falling-out-of-favor/index.html",
            "publishedAt": "2025-03-20T12:19:20Z"
        },
        {
            "title": "Elon Musk's Tesla makes largest ever Cybertruck recall",
            "description": "It is the eighth recall involving the pickup since early 2024, shortly after the truck hit the roads.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c0kgy20x0x4o",
            "publishedAt": "2025-03-20T23:56:40Z"
        },
        {
            "title": "Tesla to recall more than 46,000 Cybertrucks due to exterior panel issue | CNN Business",
            "description": "is recalling 46,096 Cybertruck vehicles in the U.S. to fix an exterior panel that could detach while driving, the latest in a series of call-backs for the pickup truck since last year.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/20/business/tesla-cybertruck-recall/index.html",
            "publishedAt": "2025-03-20T11:10:21Z"
        }
    ],
    "2025-03-19": [
        {
            "title": "Vancouver International Auto Show removes Tesla, citing safety concerns at event",
            "description": "VANCOUVER — Tesla has been removed from participating in this week’s Vancouver International Auto Show over safety concerns, the event’s executive director says. Eric Nicholl said in a statement Tuesday that the show asked the electric carmaker to withdraw be…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/vancouver-international-auto-show-removes-tesla-citing-safety-concerns-at-event",
            "publishedAt": "2025-03-19T00:09:43Z"
        },
        {
            "title": "Hedge Funds Burned by Tesla Short Bets Plot Next Steps",
            "description": "Hedge funds whose short positions against Tesla Inc. backfired badly after the Nov. 5 election are watching the latest selloff from the sidelines, for fear of being burned again.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/hedge-funds-burned-by-tesla-short-bets-plot-next-steps",
            "publishedAt": "2025-03-19T19:21:10Z"
        },
        {
            "title": "Gravity may be finally catching up to Elon Musk as Tesla stock tumbles | CNN Business",
            "description": "Gravity may be finally catching up to Elon Musk as Tesla stock tumbles | CNN Businesscnn.com",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/19/business/elon-musk-tesla-stock-nightcap/index.html",
            "publishedAt": "2025-03-19T10:24:34Z"
        },
        {
            "title": "Tesla booted from Vancouver International Auto Show over ‘safety’ | CNN Business",
            "description": "Tesla’s display at this week’s Vancouver International Auto Show was removed by event organizers because of safety issues revolving around the Elon Musk-led company.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/19/cars/tesla-removed-vancouver-auto-show/index.html",
            "publishedAt": "2025-03-19T14:22:25Z"
        }
    ],
    "2025-03-17": [
        {
            "title": "Canadians in several cities join ’Tesla Takedown’ protests",
            "description": "Canadians have joined a wave of \"Tesla Takedown\" protests to denounce CEO Elon Musk and his role advising Donald Trump. Read here for more",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/canadians-join-tesla-takedown-protests",
            "publishedAt": "2025-03-17T13:24:40Z"
        }
    ],
    "2025-03-18": [
        {
            "title": "Tesla explosion: FBI investigating vehicles shot and set on fire in Las Vegas",
            "description": "Police departments across the United States are investigating a wave of attacks on Tesla showrooms, charging stations and vehicles.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/18/us/tesla-fire-las-vegas-explosion/index.html",
            "publishedAt": "2025-03-18T19:29:45Z"
        }
    ],
    "2025-03-22": [
        {
            "title": "The Trump administration can’t stop shilling for Tesla | CNN Business",
            "description": "The White House appears to have a carrot-and-stick approach to making America love Teslas. Buy the car and the stock, officials say. And anyone caught vandalizing a charging station should expect to be labeled a “terrorist thug,” one possibly bound for a Salv…",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/21/business/tesla-trump-administration/index.html",
            "publishedAt": "2025-03-22T00:17:02Z"
        },
        {
            "title": "Backlash continues against Elon Musk’s role with DOGE as demonstrations at Tesla showrooms enter fifth week | CNN Business",
            "description": "The demonstrations want people to “sell your Teslas” and “dump your stock,” as a way of reprimanding Musk, who owns a sizable stake in the electric vehicle maker.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/22/business/musk-doge-tesla-demonstrations/index.html",
            "publishedAt": "2025-03-22T20:30:48Z"
        }
    ],
    "2025-03-25": [
        {
            "title": "Chinese EV titan BYD eclipses Tesla with annual sales of more than $100 billion",
            "description": "China’s BYD recorded revenues of 777 billion yuan ($107 billion) for 2024, surging ahead Elon Musk’s Tesla in annual sales amid intensifying competition in...",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/25/cars/china-byd-annual-sales-pass-tesla-intl-hnk",
            "publishedAt": "2025-03-25T09:39:57Z"
        },
        {
            "title": "Tesla’s No.1 rival BYD is practically taunting Elon Musk now",
            "description": "Tesla’s No.1 rival BYD is practically taunting Elon Musk nowcnn.com",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/25/business/byd-tesla-china-elon-musk-nightcap/index.html",
            "publishedAt": "2025-03-25T09:14:00Z"
        }
    ],
    "2025-03-24": [
        {
            "title": "BYD’s Sales Soar as Chinese Carmaker Captures World’s Attention",
            "description": "BYD Co.’s sales last year surpassed the $100 billion mark, leapfrogging Elon Musk’s Tesla Inc. on revenue, as the Chinese auto giant wows consumers with a range of electric and hybrid cars packed with high-tech features.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/byds-sales-soar-as-chinese-carmaker-captures-worlds-attention",
            "publishedAt": "2025-03-24T12:11:53Z"
        },
        {
            "title": "Nova Scotia legislators vote unanimously to scrap electric car rebates for Tesla",
            "description": "Nova Scotia has become the latest province to scrap EV rebates for Teslas due to Elon Musk's association with Donald Trump. Read more here",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/nova-scotia-scrap-telsa-rebates",
            "publishedAt": "2025-03-24T13:54:19Z"
        }
    ],
    "2025-03-27": [
        {
            "title": "Elon Musk’s Tesla is one of the only winners from Trump auto tariffs",
            "description": "Tesla emerges as a winner in the automotive industry amid Trump's tariffs, thanks to its domestic manufacturing operations.",
            "source": "Bloomberg",
            "url": "https://www.bloomberg.com/news/articles/2025-03-27/most-carmakers-stand-to-lose-as-trump-s-tariffs-spread-the-pain",
            "publishedAt": "2025-03-27T04:22:06Z"
        }
    ],
    "2025-03-26": [
        {
            "title": "Tesla is bringing its electric cars to oil-rich Saudi Arabia amid falling global sales | CNN Business",
            "description": "Tesla will start selling its electric vehicles in Saudi Arabia, entering the Gulf region’s largest economy as the company’s global sales are sliding and CEO Elon Musk courts controversy with his role in the US government.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/26/business/tesla-saudi-arabia-elon-musk-intl/index.html",
            "publishedAt": "2025-03-26T13:36:29Z"
        }
    ],
    "2025-03-30": [
        {
            "title": "It's the hottest car company. You can't buy one in America",
            "description": "In the world of electric vehicles (EV), a Chinese car maker has gotten the upper hand over Tesla in just a few years. And it seems to be just getting started.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/26/cars/china-byd-profile-tesla-rival-intl-hnk/index.html",
            "publishedAt": "2025-03-30T12:57:09Z"
        },
        {
            "title": "New Report: EV Mandates Risk Economic Disruption, Deepen Inequality",
            "description": "Current policies may benefit Tesla and increase vulnerability to United States VANCOUVER, British Columbia, March 30, 2025 (GLOBE NEWSWIRE) — A new report commissioned by the Energy Futures Institute, Are EV Mandates and Market Reality on a Collision Course?,…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/new-report-ev-mandates-risk-economic-disruption-deepen-inequality",
            "publishedAt": "2025-03-30T19:02:31Z"
        }
    ],
    "2025-03-29": [
        {
            "title": "Protesters rebelling against Elon Musk’s purge of US government swarm Tesla showrooms",
            "description": "SAN FRANCISCO (AP) — Crowds protesting billionaire Elon Musk’s purge of the U.S. government under President Donald Trump began amassing outside Tesla dealerships throughout the U.S. Saturday in the latest attempt to dent the fortune of the world’s richest man…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/protesters-rebelling-against-elon-musks-purge-of-us-government-swarm-tesla-showrooms",
            "publishedAt": "2025-03-29T18:18:07Z"
        },
        {
            "title": "Canadian Tesla protests part of ‘day of action’ amid fractured U.S. relationship",
            "description": "VANCOUVER — Canadians in several major cities held demonstrations at Tesla dealerships as part of an international “day of action” aimed at the company’s CEO Elon Musk and his role within the American government amid the fractured relationship between Canada …",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/canadian-tesla-protests-part-of-day-of-action-amid-fractured-u-s-relationship",
            "publishedAt": "2025-03-29T23:14:40Z"
        },
        {
            "title": "Over 200 ‘Tesla Takedown’ protests take place throughout US on ‘Global Day of Action’ against Elon Musk’s role with DOGE",
            "description": "Hundreds of “Tesla Takedown” demonstrations are taking place in the United States, Canada and Europe as activists ramp up their opposition to CEO Elon Musk’s efforts to slash federal government staffing and budgets.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/29/business/tesla-takedown-elon-musk-doge/index.html",
            "publishedAt": "2025-03-29T19:28:45Z"
        }
    ],
    "2025-03-28": [
        {
            "title": "Vancouver police deploying big presence to ‘maintain order’ at anti-Tesla protests",
            "description": "Vancouver police are investigating 28 anti-Tesla incidents and will deploy more than 130 officers to \"maintain order\" at protests. Read on",
            "source": "Financial Post",
            "url": "https://financialpost.com/commodities/energy/electric-vehicles/vancouver-police-deploying-to-maintain-order-tesla-protests",
            "publishedAt": "2025-03-28T18:57:24Z"
        },
        {
            "title": "‘I have like 17 jobs.’ Investors wonder if Elon Musk is spending enough time at Tesla",
            "description": "Investors are increasingly calling for Musk to shift focus back to Tesla as the company faces a brand crisis.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/28/cars/tesla-elon-musk-investors-doge/index.html",
            "publishedAt": "2025-03-28T11:42:11Z"
        }
    ],
    "2025-03-31": [
        {
            "title": "Fire at Tesla dealership near Rome destroys 17 cars | CNN",
            "description": "At least 17 Tesla cars were destroyed after a fire broke out at a dealership on the outskirts of Rome on Monday morning, according to Italian fire officials. No one was at the dealership when the fire broke out and no injuries have been reported.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/31/europe/tesla-cars-fire-rome-intl/index.html",
            "publishedAt": "2025-03-31T10:42:29Z"
        },
        {
            "title": "U.S. stocks post worst quarter compared with global markets since 2009",
            "description": "Markets saw wild swings Monday in the run-up to Wednesday's reciprocal tariff rollout as gold soared and Tesla and Nvidia slumped. Read on.",
            "source": "Financial Post",
            "url": "https://financialpost.com/news/stocks-wild-swings-tariff-rollout",
            "publishedAt": "2025-03-31T20:50:35Z"
        }
    ]
}