{
    "2025-02-05": [
        {
            "title": "Japan’s Toyota announces EV and battery push in China and U.S., as its quarterly profit surges",
            "description": "TOKYO (AP) — Toyota is developing and making electric vehicles and EV batteries in China, the Japanese automaker said Wednesday, under a new partnership with the Shanghai government. Toyota Motor Corp. also announced it will start producing batteries for EVs,…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/japans-toyota-announces-ev-and-battery-push-in-china-and-u-s-as-its-quarterly-profit-surges",
            "publishedAt": "2025-02-05T06:25:56Z"
        },
        {
            "title": "Toyota Raises Annual Profit Guidance Despite Drop in Quarter",
            "description": "Toyota Motor Corp. raised its annual operating profit outlook even though quarterly income fell short of estimates due to a downturn in global sales and production, indicating that it sees activity picking up at a faster pace later.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/toyota-raises-annual-profit-guidance-despite-drop-in-quarter",
            "publishedAt": "2025-02-05T05:44:04Z"
        }
    ],
    "2025-01-16": [
        {
            "title": "Toyota’s truck division Hino to pay $1.6 billion as part of emissions scandal",
            "description": "A Toyota division that manufactures trucks will pay more than $1.6 billion and plead guilty to violations related to the submission of false and fraudulent engine emission testing and fuel consumption data to regulators and the illicit smuggling of engines in…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/toyotas-truck-division-hino-to-pay-1-6-billion-as-part-of-emissions-scandal",
            "publishedAt": "2025-01-16T16:43:07Z"
        }
    ],
    "2025-01-15": [
        {
            "title": "Manufacturer Discipline and Consistency Leads to High Residual Values in Canada, J.D. Power Finds",
            "description": "Toyota (Mass Market) and Lexus (Premium) Earn Top Brand Awards for Sixth and Fifth Consecutive Year, Respectively TORONTO — Vehicle manufacturers with a more balanced and consistent strategy when bringing their products to market have proven to be the leaders…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/manufacturer-discipline-and-consistency-leads-to-high-residual-values-in-canada-j-d-power-finds",
            "publishedAt": "2025-01-15T11:03:14Z"
        }
    ],
    "2025-02-18": [
        {
            "title": "Toyota Is Supporting LG Battery Plant With $1.5 Billion Order",
            "description": "Toyota Motor Corp. has agreed to shift a $1.5 billion order with LG Energy Solution to bolster operations at a Michigan battery plant after General Motors Co. backed out of the project, according to people familiar with the matter.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/toyota-is-supporting-lg-battery-plant-with-1-5-billion-order",
            "publishedAt": "2025-02-18T16:57:54Z"
        }
    ],
    "2025-02-25": [
        {
            "title": "Toyota reshuffles its board, adding auditors and outsiders",
            "description": "TOKYO (AP) — Toyota announced plans to restructure its board on Tuesday in what it described as an attempt to bring in more diverse views and give a larger roles to auditors. Among six appointments is Christopher Reynolds, now an executive in the automaker’s …",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/toyota-reshuffles-its-board-adding-auditors-and-outsiders",
            "publishedAt": "2025-02-25T09:51:01Z"
        }
    ],
    "2025-03-28": [
        {
            "title": "Candiac Toyota wins the 2024 President’s Award",
            "description": "MONTRÉAL — Candiac Toyota is the recipient of Toyota’s 2024 President’s Program, recognizing dealers for their outstanding achievements in excellence, particularly in terms of customer service. “Whether you’re buying a vehicle or visiting our service departme…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/candiac-toyota-wins-the-2024-presidents-award",
            "publishedAt": "2025-03-28T14:09:13Z"
        }
    ]
}