{
    "2025-01-28": [
        {
            "title": "Elon Musk’s X partners with Visa on payment service in an effort to become an ‘everything app,’",
            "description": "NEW YORK (AP) — X is teaming up with Visa to soon offer a system for real-time payments on the social media platform — signaling some progress in a yearslong vision from billionaire owner Elon Musk to create an “everything app.” Visa is the first partner for …",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/elon-musks-x-partners-with-visa-on-payment-service-in-an-effort-to-become-an-everything-app",
            "publishedAt": "2025-01-28T19:18:26Z"
        }
    ],
    "2025-01-14": [
        {
            "title": "Uplinq and Visa Case Study Reveals 50% Reduction in Underwriting Costs by Using AI-Powered Credit Assessment Technology",
            "description": "New report details automated credit decisioning technology’s ability to enhance risk evaluation, remove bias, and drive profitability for lenders Uplinq, the first global credit decisioning support platform for small business lenders, announced today the rele…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/uplinq-and-visa-case-study-reveals-50-reduction-in-underwriting-costs-by-using-ai-powered-credit-assessment-technology",
            "publishedAt": "2025-01-14T14:16:58Z"
        }
    ],
    "2025-01-23": [
        {
            "title": "CTA Responds to President Trump’s Executive Order Putting Visa Process Under Spotlight",
            "description": "TORONTO, Jan. 23, 2025 (GLOBE NEWSWIRE) — The U.S. government has committed over the next 60 days to reviewing its immigration processes to protect “its citizens from aliens who intend to commit terrorist attacks, threaten our national security, espouse hatef…",
            "source": "Financial Post",
            "url": "https://financialpost.com/globe-newswire/cta-responds-to-president-trumps-executive-order-putting-visa-process-under-spotlight",
            "publishedAt": "2025-01-23T18:17:07Z"
        }
    ],
    "2025-01-27": [
        {
            "title": "Trump’s Birthright Citizenship Rattles H-1B Visa Workers Expecting a Baby",
            "description": "Ajay loves living in America, and he says until recently it felt like America loved having him.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/trumps-birthright-citizenship-rattles-h-1b-visa-workers-expecting-a-baby",
            "publishedAt": "2025-01-27T13:22:13Z"
        }
    ],
    "2025-01-26": [
        {
            "title": "Trump orders tariffs, visa restrictions on Colombia over rejection of deportation flights",
            "description": "BOGOTA, Colombia (AP) — U.S. President Donald Trump said Sunday that he was ordering tariffs, visa restrictions and other retaliatory measures to be taken against Colombia after its government rejected two flights carrying migrants. Trump made the announcemen…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/trump-orders-tariffs-visa-restrictions-on-colombia-over-rejection-of-deportation-flights",
            "publishedAt": "2025-01-26T19:10:31Z"
        }
    ],
    "2025-02-13": [
        {
            "title": "Visa Cash App Racing Bulls Announces Partnership With the Exclusive Student Housing Marketplace, Student.com",
            "description": "Student.com, a Dot Group company, unveils its exclusive sponsorship of Visa Cash App Racing Bulls A first of its kind collaboration connecting the student housing industry and the world of motorsport to a whole new generation of students and fans This partner…",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/visa-cash-app-racing-bulls-announces-partnership-with-the-exclusive-student-housing-marketplace-student-com",
            "publishedAt": "2025-02-13T15:11:29Z"
        }
    ],
    "2025-02-25": [
        {
            "title": "Trump to Offer ‘Gold Card’ Visas for $5 Million to the Rich",
            "description": "President Donald Trump said he is starting a program to offer residency and a path to citizenship to investors who pay $5 million, offering a new avenue for legal immigration even as he carries out a sweeping crackdown on undocumented migrants.",
            "source": "Financial Post",
            "url": "https://financialpost.com/pmn/business-pmn/trump-to-offer-gold-card-visas-for-5-million-to-the-rich",
            "publishedAt": "2025-02-25T22:32:49Z"
        }
    ],
    "2025-02-26": [
        {
            "title": "US will sell ‘gold card’ to wealthy foreigners, Trump says, replacing EB-5 visa program",
            "description": "President Donald Trump said the US would be selling what he described as a “gold card” to wealthy foreigners, giving them the right to live and work in the US and offering a path to citizenship in exchange for a $5 million fee.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/02/25/politics/us-gold-card-foreigners-trump/index.html",
            "publishedAt": "2025-02-26T02:38:19Z"
        },
        {
            "title": "Trump says $5m 'gold card' immigration idea will 'sell like crazy'",
            "description": "Trump say wealthy investors will buy the visas and create jobs in the US, while helping pay off US debt.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/cq5zgvdz2z0o",
            "publishedAt": "2025-02-26T20:13:24Z"
        }
    ],
    "2025-03-07": [
        {
            "title": "US reviewing visa programs as official says Afghanistan could be included in Trump travel ban | CNN Politics",
            "description": "The US State Department is “undertaking a full review of all visa programs,” a department spokesperson confirmed amid reports of an impending new travel ban, and a US official familiar with the situation told CNN that Afghanistan could be among the countries …",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/07/politics/state-department-reviewing-visas-travel-ban-afghanistan/index.html",
            "publishedAt": "2025-03-07T23:44:01Z"
        }
    ],
    "2025-03-10": [
        {
            "title": "Dad of detained US tourist urges care on visa requirements",
            "description": "Becky Burke, 28, has spent 10 days in a facility in Washington State and is desperate to come home.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c80y3yx1jdyo",
            "publishedAt": "2025-03-10T13:00:46Z"
        }
    ],
    "2025-03-17": [
        {
            "title": "Doctor at Brown University deported to Lebanon despite US judge’s order | CNN",
            "description": "A Rhode Island doctor who is an assistant professor at Brown University’s medical school has been deported to Lebanon even though a judge had issued an order blocking the U.S. visa holder’s immediate removal from the country, according to court papers.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/17/us/brown-university-doctor-deported-hnk/index.html",
            "publishedAt": "2025-03-17T05:16:39Z"
        },
        {
            "title": "Prince Harry: Deadline looms for Homeland Security to release visa records",
            "description": "A US judge ordered the prince's immigration record to be made public after a think tank alleged he lied about past drug use.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c3w13w757lgo",
            "publishedAt": "2025-03-17T18:56:44Z"
        }
    ],
    "2025-03-18": [
        {
            "title": "Prince Harry's US visa documents unsealed after drug claims",
            "description": "They are heavily redacted, and no details have been given as to what he put on his immigration form.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c4gevr32g98o",
            "publishedAt": "2025-03-18T21:36:07Z"
        }
    ],
    "2025-03-20": [
        {
            "title": "US court blocks deportation of Georgetown University researcher",
            "description": "Immigration officials accuse Badar Khan Suri, an Indian academic on a student visa, of \"spreading Hamas propaganda\", an allegation he denies.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c1enyqjgjlqo",
            "publishedAt": "2025-03-20T16:07:01Z"
        }
    ],
    "2025-03-26": [
        {
            "title": "Momodou Taal: Visa of Cornell University student fighting deportation is revoked by the State Department",
            "description": "Attorneys for a Cornell graduate student whose student visa was recently revoked and has been targeted for deportation by the Trump administration said the case will be a test to determine whether the US government can target people for expressing views that …",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/25/us/cornell-unversity-student-visa-revoked/index.html",
            "publishedAt": "2025-03-26T00:39:31Z"
        }
    ],
    "2025-03-30": [
        {
            "title": "Secret filming reveals brazen tactics of UK visa sponsorship scammers",
            "description": "An undercover BBC investigation exposes how rogue agents are exploiting a UK visa scheme.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c1en4dx7yn9o",
            "publishedAt": "2025-03-30T23:08:52Z"
        }
    ],
    "2025-03-28": [
        {
            "title": "Cornell student activist denied bid to immediately stop the government from trying to deport him | CNN",
            "description": "A judge on Thursday declined to immediately block the U.S. government from taking steps to deport a Cornell University student whose visa was revoked over his participation in campus demonstrations.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/28/us/cornell-student-activist-deportation-hearing/index.html",
            "publishedAt": "2025-03-28T10:14:46Z"
        }
    ],
    "2025-03-29": [
        {
            "title": "They’ve lived in the US on visas and work permits for decades. Now they’re in ICE detention | CNN",
            "description": "Amid the Trump administration’s immigration crackdown, some longtime US residents like Taylor who have visas, work permits or green cards face possible deportation.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/29/us/longtime-migrants-facing-deportations/index.html",
            "publishedAt": "2025-03-29T13:13:57Z"
        }
    ],
    "2025-04-01": [
        {
            "title": "Cornell student activist chooses to leave US after judge denies bid to block deportation | CNN",
            "description": "A Cornell University student whose visa was revoked over his participation in pro-Palestinian campus demonstrations says he is leaving the United States voluntarily after a judge denied a request that the government not take steps to deport him.",
            "source": "CNN",
            "url": "https://www.cnn.com/2025/03/31/us/cornell-student-activist-deportation/index.html",
            "publishedAt": "2025-04-01T01:15:44Z"
        },
        {
            "title": "Cornell University student targeted by Trump leaves the US",
            "description": "British citizen Momodou Taal had his visa revoked due to protest activities opposing Israel.",
            "source": "BBC News",
            "url": "https://www.bbc.co.uk/news/articles/c934y9kv07eo",
            "publishedAt": "2025-04-01T03:12:16Z"
        }
    ]
}